Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x241 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xbeeae): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xcc1a0): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xa3d77): C:/Users/bjbiv/OneDrive/School/2024_Spring/SeniorDesign/RoverCode/Drone-software/RoverCode/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 2 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x10cba): unsigned int
 <1><38>: Abbrev Number: 2 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5d1a1): long long int
 <1><3f>: Abbrev Number: 2 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0x13083): long double
 <1><46>: Abbrev Number: 2 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x665f1): signed char
 <1><4d>: Abbrev Number: 2 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 1
    <4f>   DW_AT_encoding    : 8	(unsigned char)
    <50>   DW_AT_name        : (indirect string, offset: 0xc7420): unsigned char
 <1><54>: Abbrev Number: 2 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 2
    <56>   DW_AT_encoding    : 5	(signed)
    <57>   DW_AT_name        : (indirect string, offset: 0x99a8d): short int
 <1><5b>: Abbrev Number: 2 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2
    <5d>   DW_AT_encoding    : 7	(unsigned)
    <5e>   DW_AT_name        : (indirect string, offset: 0xc5d8d): short unsigned int
 <1><62>: Abbrev Number: 2 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 4
    <64>   DW_AT_encoding    : 5	(signed)
    <65>   DW_AT_name        : (indirect string, offset: 0x1176c): long int
 <1><69>: Abbrev Number: 3 (DW_TAG_typedef)
    <6a>   DW_AT_name        : (indirect string, offset: 0x829ed): __uint32_t
    <6e>   DW_AT_decl_file   : 2
    <6f>   DW_AT_decl_line   : 79
    <70>   DW_AT_decl_column : 25
    <71>   DW_AT_type        : <0x75>
 <1><75>: Abbrev Number: 2 (DW_TAG_base_type)
    <76>   DW_AT_byte_size   : 4
    <77>   DW_AT_encoding    : 7	(unsigned)
    <78>   DW_AT_name        : (indirect string, offset: 0x4dabe): long unsigned int
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 8
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x2a989): long long unsigned int
 <1><83>: Abbrev Number: 3 (DW_TAG_typedef)
    <84>   DW_AT_name        : (indirect string, offset: 0x95974): uint32_t
    <88>   DW_AT_decl_file   : 3
    <89>   DW_AT_decl_line   : 48
    <8a>   DW_AT_decl_column : 20
    <8b>   DW_AT_type        : <0x69>
 <1><8f>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <90>   DW_AT_type        : <0x83>
 <1><94>: Abbrev Number: 9 (DW_TAG_const_type)
    <95>   DW_AT_type        : <0x8f>
 <1><99>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 1
    <9b>   DW_AT_encoding    : 8	(unsigned char)
    <9c>   DW_AT_name        : (indirect string, offset: 0x42260): char
 <1><a0>: Abbrev Number: 10 (DW_TAG_array_type)
    <a1>   DW_AT_type        : <0x83>
    <a5>   DW_AT_sibling     : <0xb0>
 <2><a9>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <aa>   DW_AT_type        : <0x31>
    <ae>   DW_AT_upper_bound : 0
 <2><af>: Abbrev Number: 0
 <1><b0>: Abbrev Number: 4 (DW_TAG_structure_type)
    <b1>   DW_AT_byte_size   : 92
    <b2>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 904
    <b4>   DW_AT_decl_column : 9
    <b4>   DW_AT_sibling     : <0x1cd>
 <2><b8>: Abbrev Number: 1 (DW_TAG_member)
    <b9>   DW_AT_name        : (indirect string, offset: 0xf94e): CTRL
    <bd>   DW_AT_decl_file   : 4
    <bd>   DW_AT_decl_line   : 906
    <bf>   DW_AT_decl_column : 18
    <bf>   DW_AT_type        : <0x8f>
    <c3>   DW_AT_data_member_location: 0
 <2><c4>: Abbrev Number: 1 (DW_TAG_member)
    <c5>   DW_AT_name        : (indirect string, offset: 0x3e9db): CYCCNT
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 907
    <cb>   DW_AT_decl_column : 18
    <cb>   DW_AT_type        : <0x8f>
    <cf>   DW_AT_data_member_location: 4
 <2><d0>: Abbrev Number: 1 (DW_TAG_member)
    <d1>   DW_AT_name        : (indirect string, offset: 0x6b8f9): CPICNT
    <d5>   DW_AT_decl_file   : 4
    <d5>   DW_AT_decl_line   : 908
    <d7>   DW_AT_decl_column : 18
    <d7>   DW_AT_type        : <0x8f>
    <db>   DW_AT_data_member_location: 8
 <2><dc>: Abbrev Number: 1 (DW_TAG_member)
    <dd>   DW_AT_name        : (indirect string, offset: 0xaee7a): EXCCNT
    <e1>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 909
    <e3>   DW_AT_decl_column : 18
    <e3>   DW_AT_type        : <0x8f>
    <e7>   DW_AT_data_member_location: 12
 <2><e8>: Abbrev Number: 1 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x458c9): SLEEPCNT
    <ed>   DW_AT_decl_file   : 4
    <ed>   DW_AT_decl_line   : 910
    <ef>   DW_AT_decl_column : 18
    <ef>   DW_AT_type        : <0x8f>
    <f3>   DW_AT_data_member_location: 16
 <2><f4>: Abbrev Number: 1 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0x6e3ef): LSUCNT
    <f9>   DW_AT_decl_file   : 4
    <f9>   DW_AT_decl_line   : 911
    <fb>   DW_AT_decl_column : 18
    <fb>   DW_AT_type        : <0x8f>
    <ff>   DW_AT_data_member_location: 20
 <2><100>: Abbrev Number: 1 (DW_TAG_member)
    <101>   DW_AT_name        : (indirect string, offset: 0x842e6): FOLDCNT
    <105>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 912
    <107>   DW_AT_decl_column : 18
    <107>   DW_AT_type        : <0x8f>
    <10b>   DW_AT_data_member_location: 24
 <2><10c>: Abbrev Number: 1 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0x7cfc9): PCSR
    <111>   DW_AT_decl_file   : 4
    <111>   DW_AT_decl_line   : 913
    <113>   DW_AT_decl_column : 18
    <113>   DW_AT_type        : <0x94>
    <117>   DW_AT_data_member_location: 28
 <2><118>: Abbrev Number: 1 (DW_TAG_member)
    <119>   DW_AT_name        : (indirect string, offset: 0x8fdc7): COMP0
    <11d>   DW_AT_decl_file   : 4
    <11d>   DW_AT_decl_line   : 914
    <11f>   DW_AT_decl_column : 18
    <11f>   DW_AT_type        : <0x8f>
    <123>   DW_AT_data_member_location: 32
 <2><124>: Abbrev Number: 1 (DW_TAG_member)
    <125>   DW_AT_name        : (indirect string, offset: 0x810d0): MASK0
    <129>   DW_AT_decl_file   : 4
    <129>   DW_AT_decl_line   : 915
    <12b>   DW_AT_decl_column : 18
    <12b>   DW_AT_type        : <0x8f>
    <12f>   DW_AT_data_member_location: 36
 <2><130>: Abbrev Number: 1 (DW_TAG_member)
    <131>   DW_AT_name        : (indirect string, offset: 0x3034): FUNCTION0
    <135>   DW_AT_decl_file   : 4
    <135>   DW_AT_decl_line   : 916
    <137>   DW_AT_decl_column : 18
    <137>   DW_AT_type        : <0x8f>
    <13b>   DW_AT_data_member_location: 40
 <2><13c>: Abbrev Number: 1 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xc2a6f): RESERVED0
    <141>   DW_AT_decl_file   : 4
    <141>   DW_AT_decl_line   : 917
    <143>   DW_AT_decl_column : 18
    <143>   DW_AT_type        : <0xa0>
    <147>   DW_AT_data_member_location: 44
 <2><148>: Abbrev Number: 1 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0xfb92): COMP1
    <14d>   DW_AT_decl_file   : 4
    <14d>   DW_AT_decl_line   : 918
    <14f>   DW_AT_decl_column : 18
    <14f>   DW_AT_type        : <0x8f>
    <153>   DW_AT_data_member_location: 48
 <2><154>: Abbrev Number: 1 (DW_TAG_member)
    <155>   DW_AT_name        : (indirect string, offset: 0x65f8a): MASK1
    <159>   DW_AT_decl_file   : 4
    <159>   DW_AT_decl_line   : 919
    <15b>   DW_AT_decl_column : 18
    <15b>   DW_AT_type        : <0x8f>
    <15f>   DW_AT_data_member_location: 52
 <2><160>: Abbrev Number: 1 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x303e): FUNCTION1
    <165>   DW_AT_decl_file   : 4
    <165>   DW_AT_decl_line   : 920
    <167>   DW_AT_decl_column : 18
    <167>   DW_AT_type        : <0x8f>
    <16b>   DW_AT_data_member_location: 56
 <2><16c>: Abbrev Number: 1 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0xc2a79): RESERVED1
    <171>   DW_AT_decl_file   : 4
    <171>   DW_AT_decl_line   : 921
    <173>   DW_AT_decl_column : 18
    <173>   DW_AT_type        : <0xa0>
    <177>   DW_AT_data_member_location: 60
 <2><178>: Abbrev Number: 1 (DW_TAG_member)
    <179>   DW_AT_name        : (indirect string, offset: 0x1a56e): COMP2
    <17d>   DW_AT_decl_file   : 4
    <17d>   DW_AT_decl_line   : 922
    <17f>   DW_AT_decl_column : 18
    <17f>   DW_AT_type        : <0x8f>
    <183>   DW_AT_data_member_location: 64
 <2><184>: Abbrev Number: 1 (DW_TAG_member)
    <185>   DW_AT_name        : (indirect string, offset: 0x810d6): MASK2
    <189>   DW_AT_decl_file   : 4
    <189>   DW_AT_decl_line   : 923
    <18b>   DW_AT_decl_column : 18
    <18b>   DW_AT_type        : <0x8f>
    <18f>   DW_AT_data_member_location: 68
 <2><190>: Abbrev Number: 1 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0x3048): FUNCTION2
    <195>   DW_AT_decl_file   : 4
    <195>   DW_AT_decl_line   : 924
    <197>   DW_AT_decl_column : 18
    <197>   DW_AT_type        : <0x8f>
    <19b>   DW_AT_data_member_location: 72
 <2><19c>: Abbrev Number: 1 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0xc2a83): RESERVED2
    <1a1>   DW_AT_decl_file   : 4
    <1a1>   DW_AT_decl_line   : 925
    <1a3>   DW_AT_decl_column : 18
    <1a3>   DW_AT_type        : <0xa0>
    <1a7>   DW_AT_data_member_location: 76
 <2><1a8>: Abbrev Number: 1 (DW_TAG_member)
    <1a9>   DW_AT_name        : (indirect string, offset: 0xa8e9a): COMP3
    <1ad>   DW_AT_decl_file   : 4
    <1ad>   DW_AT_decl_line   : 926
    <1af>   DW_AT_decl_column : 18
    <1af>   DW_AT_type        : <0x8f>
    <1b3>   DW_AT_data_member_location: 80
 <2><1b4>: Abbrev Number: 1 (DW_TAG_member)
    <1b5>   DW_AT_name        : (indirect string, offset: 0x65fc6): MASK3
    <1b9>   DW_AT_decl_file   : 4
    <1b9>   DW_AT_decl_line   : 927
    <1bb>   DW_AT_decl_column : 18
    <1bb>   DW_AT_type        : <0x8f>
    <1bf>   DW_AT_data_member_location: 84
 <2><1c0>: Abbrev Number: 1 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3052): FUNCTION3
    <1c5>   DW_AT_decl_file   : 4
    <1c5>   DW_AT_decl_line   : 928
    <1c7>   DW_AT_decl_column : 18
    <1c7>   DW_AT_type        : <0x8f>
    <1cb>   DW_AT_data_member_location: 88
 <2><1cc>: Abbrev Number: 0
 <1><1cd>: Abbrev Number: 5 (DW_TAG_typedef)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x370ae): DWT_Type
    <1d2>   DW_AT_decl_file   : 4
    <1d2>   DW_AT_decl_line   : 929
    <1d4>   DW_AT_decl_column : 3
    <1d4>   DW_AT_type        : <0xb0>
 <1><1d8>: Abbrev Number: 4 (DW_TAG_structure_type)
    <1d9>   DW_AT_byte_size   : 16
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 1421
    <1dc>   DW_AT_decl_column : 9
    <1dc>   DW_AT_sibling     : <0x211>
 <2><1e0>: Abbrev Number: 1 (DW_TAG_member)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x9bbb8): DHCSR
    <1e5>   DW_AT_decl_file   : 4
    <1e5>   DW_AT_decl_line   : 1423
    <1e7>   DW_AT_decl_column : 18
    <1e7>   DW_AT_type        : <0x8f>
    <1eb>   DW_AT_data_member_location: 0
 <2><1ec>: Abbrev Number: 1 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0xb2d54): DCRSR
    <1f1>   DW_AT_decl_file   : 4
    <1f1>   DW_AT_decl_line   : 1424
    <1f3>   DW_AT_decl_column : 18
    <1f3>   DW_AT_type        : <0x8f>
    <1f7>   DW_AT_data_member_location: 4
 <2><1f8>: Abbrev Number: 1 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xc71fe): DCRDR
    <1fd>   DW_AT_decl_file   : 4
    <1fd>   DW_AT_decl_line   : 1425
    <1ff>   DW_AT_decl_column : 18
    <1ff>   DW_AT_type        : <0x8f>
    <203>   DW_AT_data_member_location: 8
 <2><204>: Abbrev Number: 1 (DW_TAG_member)
    <205>   DW_AT_name        : (indirect string, offset: 0x693ee): DEMCR
    <209>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 1426
    <20b>   DW_AT_decl_column : 18
    <20b>   DW_AT_type        : <0x8f>
    <20f>   DW_AT_data_member_location: 12
 <2><210>: Abbrev Number: 0
 <1><211>: Abbrev Number: 5 (DW_TAG_typedef)
    <212>   DW_AT_name        : (indirect string, offset: 0x56e56): CoreDebug_Type
    <216>   DW_AT_decl_file   : 4
    <216>   DW_AT_decl_line   : 1427
    <218>   DW_AT_decl_column : 3
    <218>   DW_AT_type        : <0x1d8>
 <1><21c>: Abbrev Number: 12 (DW_TAG_subprogram)
    <21d>   DW_AT_external    : 1
    <21d>   DW_AT_name        : (indirect string, offset: 0x5cda3): getRunTimeCounterValue
    <221>   DW_AT_decl_file   : 1
    <222>   DW_AT_decl_line   : 68
    <223>   DW_AT_decl_column : 22
    <224>   DW_AT_prototyped  : 1
    <224>   DW_AT_type        : <0x75>
    <228>   DW_AT_low_pc      : 0x8000eb8
    <22c>   DW_AT_high_pc     : 0x18
    <230>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <232>   DW_AT_call_all_calls: 1
 <1><232>: Abbrev Number: 13 (DW_TAG_subprogram)
    <233>   DW_AT_external    : 1
    <233>   DW_AT_name        : (indirect string, offset: 0x2adbf): configureTimerForRunTimeStats
    <237>   DW_AT_decl_file   : 1
    <238>   DW_AT_decl_line   : 61
    <239>   DW_AT_decl_column : 13
    <23a>   DW_AT_prototyped  : 1
    <23a>   DW_AT_low_pc      : 0x8000e84
    <23e>   DW_AT_high_pc     : 0x34
    <242>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <244>   DW_AT_call_all_calls: 1
 <1><244>: Abbrev Number: 0
  Compilation Unit @ offset 0x245:
   Length:        0x1a81 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xc4
   Pointer Size:  4
 <0><251>: Abbrev Number: 39 (DW_TAG_compile_unit)
    <252>   DW_AT_producer    : (indirect string, offset: 0xbeeae): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <256>   DW_AT_language    : 29	(C11)
    <257>   DW_AT_name        : (indirect string, offset: 0xd11fe): ../Core/Src/main.c
    <25b>   DW_AT_comp_dir    : (indirect string, offset: 0xa3d77): C:/Users/bjbiv/OneDrive/School/2024_Spring/SeniorDesign/RoverCode/Drone-software/RoverCode/Debug
    <25f>   DW_AT_ranges      : 0x25
    <263>   DW_AT_low_pc      : 0x0
    <267>   DW_AT_stmt_list   : 0x999
    <26b>   DW_AT_macros      : 0x20bcc
 <1><26f>: Abbrev Number: 11 (DW_TAG_base_type)
    <270>   DW_AT_byte_size   : 1
    <271>   DW_AT_encoding    : 6	(signed char)
    <272>   DW_AT_name        : (indirect string, offset: 0x665f1): signed char
 <1><276>: Abbrev Number: 5 (DW_TAG_typedef)
    <277>   DW_AT_name        : (indirect string, offset: 0xcfd6c): __uint8_t
    <27b>   DW_AT_decl_file   : 3
    <27c>   DW_AT_decl_line   : 43
    <27d>   DW_AT_decl_column : 24
    <27e>   DW_AT_type        : <0x282>
 <1><282>: Abbrev Number: 11 (DW_TAG_base_type)
    <283>   DW_AT_byte_size   : 1
    <284>   DW_AT_encoding    : 8	(unsigned char)
    <285>   DW_AT_name        : (indirect string, offset: 0xc7420): unsigned char
 <1><289>: Abbrev Number: 11 (DW_TAG_base_type)
    <28a>   DW_AT_byte_size   : 2
    <28b>   DW_AT_encoding    : 5	(signed)
    <28c>   DW_AT_name        : (indirect string, offset: 0x99a8d): short int
 <1><290>: Abbrev Number: 5 (DW_TAG_typedef)
    <291>   DW_AT_name        : (indirect string, offset: 0xd0ed0): __uint16_t
    <295>   DW_AT_decl_file   : 3
    <296>   DW_AT_decl_line   : 57
    <297>   DW_AT_decl_column : 25
    <298>   DW_AT_type        : <0x29c>
 <1><29c>: Abbrev Number: 11 (DW_TAG_base_type)
    <29d>   DW_AT_byte_size   : 2
    <29e>   DW_AT_encoding    : 7	(unsigned)
    <29f>   DW_AT_name        : (indirect string, offset: 0xc5d8d): short unsigned int
 <1><2a3>: Abbrev Number: 11 (DW_TAG_base_type)
    <2a4>   DW_AT_byte_size   : 4
    <2a5>   DW_AT_encoding    : 5	(signed)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x1176c): long int
 <1><2aa>: Abbrev Number: 5 (DW_TAG_typedef)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x829ed): __uint32_t
    <2af>   DW_AT_decl_file   : 3
    <2b0>   DW_AT_decl_line   : 79
    <2b1>   DW_AT_decl_column : 25
    <2b2>   DW_AT_type        : <0x2b6>
 <1><2b6>: Abbrev Number: 11 (DW_TAG_base_type)
    <2b7>   DW_AT_byte_size   : 4
    <2b8>   DW_AT_encoding    : 7	(unsigned)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x4dabe): long unsigned int
 <1><2bd>: Abbrev Number: 11 (DW_TAG_base_type)
    <2be>   DW_AT_byte_size   : 8
    <2bf>   DW_AT_encoding    : 5	(signed)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x5d1a1): long long int
 <1><2c4>: Abbrev Number: 11 (DW_TAG_base_type)
    <2c5>   DW_AT_byte_size   : 8
    <2c6>   DW_AT_encoding    : 7	(unsigned)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x2a989): long long unsigned int
 <1><2cb>: Abbrev Number: 40 (DW_TAG_base_type)
    <2cc>   DW_AT_byte_size   : 4
    <2cd>   DW_AT_encoding    : 5	(signed)
    <2ce>   DW_AT_name        : int
 <1><2d2>: Abbrev Number: 11 (DW_TAG_base_type)
    <2d3>   DW_AT_byte_size   : 4
    <2d4>   DW_AT_encoding    : 7	(unsigned)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x10cba): unsigned int
 <1><2d9>: Abbrev Number: 5 (DW_TAG_typedef)
    <2da>   DW_AT_name        : (indirect string, offset: 0xcfd6e): uint8_t
    <2de>   DW_AT_decl_file   : 4
    <2df>   DW_AT_decl_line   : 24
    <2e0>   DW_AT_decl_column : 19
    <2e1>   DW_AT_type        : <0x276>
 <1><2e5>: Abbrev Number: 17 (DW_TAG_const_type)
    <2e6>   DW_AT_type        : <0x2d9>
 <1><2ea>: Abbrev Number: 5 (DW_TAG_typedef)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x961ed): uint16_t
    <2ef>   DW_AT_decl_file   : 4
    <2f0>   DW_AT_decl_line   : 36
    <2f1>   DW_AT_decl_column : 20
    <2f2>   DW_AT_type        : <0x290>
 <1><2f6>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <2f7>   DW_AT_type        : <0x2ea>
 <1><2fb>: Abbrev Number: 5 (DW_TAG_typedef)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x95974): uint32_t
    <300>   DW_AT_decl_file   : 4
    <301>   DW_AT_decl_line   : 48
    <302>   DW_AT_decl_column : 20
    <303>   DW_AT_type        : <0x2aa>
 <1><307>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <308>   DW_AT_type        : <0x2fb>
 <1><30c>: Abbrev Number: 23 (DW_TAG_array_type)
    <30d>   DW_AT_type        : <0x2fb>
    <311>   DW_AT_sibling     : <0x31c>
 <2><315>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <316>   DW_AT_type        : <0x2d2>
    <31a>   DW_AT_upper_bound : 1
 <2><31b>: Abbrev Number: 0
 <1><31c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <31d>   DW_AT_byte_size   : 24
    <31e>   DW_AT_decl_file   : 5
    <31f>   DW_AT_decl_line   : 362
    <321>   DW_AT_decl_column : 9
    <321>   DW_AT_sibling     : <0x373>
 <2><325>: Abbrev Number: 7 (DW_TAG_member)
    <326>   DW_AT_name        : CR
    <329>   DW_AT_decl_file   : 5
    <329>   DW_AT_decl_line   : 364
    <32b>   DW_AT_decl_column : 17
    <32b>   DW_AT_type        : <0x307>
    <32f>   DW_AT_data_member_location: 0
 <2><330>: Abbrev Number: 3 (DW_TAG_member)
    <331>   DW_AT_name        : (indirect string, offset: 0xcf756): NDTR
    <335>   DW_AT_decl_file   : 5
    <336>   DW_AT_decl_line   : 365
    <338>   DW_AT_decl_column : 17
    <339>   DW_AT_type        : <0x307>
    <33d>   DW_AT_data_member_location: 4
 <2><33e>: Abbrev Number: 7 (DW_TAG_member)
    <33f>   DW_AT_name        : PAR
    <343>   DW_AT_decl_file   : 5
    <343>   DW_AT_decl_line   : 366
    <345>   DW_AT_decl_column : 17
    <345>   DW_AT_type        : <0x307>
    <349>   DW_AT_data_member_location: 8
 <2><34a>: Abbrev Number: 3 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xd0157): M0AR
    <34f>   DW_AT_decl_file   : 5
    <350>   DW_AT_decl_line   : 367
    <352>   DW_AT_decl_column : 17
    <353>   DW_AT_type        : <0x307>
    <357>   DW_AT_data_member_location: 12
 <2><358>: Abbrev Number: 3 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0xd05a0): M1AR
    <35d>   DW_AT_decl_file   : 5
    <35e>   DW_AT_decl_line   : 368
    <360>   DW_AT_decl_column : 17
    <361>   DW_AT_type        : <0x307>
    <365>   DW_AT_data_member_location: 16
 <2><366>: Abbrev Number: 7 (DW_TAG_member)
    <367>   DW_AT_name        : FCR
    <36b>   DW_AT_decl_file   : 5
    <36b>   DW_AT_decl_line   : 369
    <36d>   DW_AT_decl_column : 17
    <36d>   DW_AT_type        : <0x307>
    <371>   DW_AT_data_member_location: 20
 <2><372>: Abbrev Number: 0
 <1><373>: Abbrev Number: 12 (DW_TAG_typedef)
    <374>   DW_AT_name        : (indirect string, offset: 0xcf763): DMA_Stream_TypeDef
    <378>   DW_AT_decl_file   : 5
    <379>   DW_AT_decl_line   : 370
    <37b>   DW_AT_decl_column : 3
    <37b>   DW_AT_type        : <0x31c>
 <1><37f>: Abbrev Number: 23 (DW_TAG_array_type)
    <380>   DW_AT_type        : <0x307>
    <384>   DW_AT_sibling     : <0x38f>
 <2><388>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <389>   DW_AT_type        : <0x2d2>
    <38d>   DW_AT_upper_bound : 1
 <2><38e>: Abbrev Number: 0
 <1><38f>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <390>   DW_AT_type        : <0x37f>
 <1><394>: Abbrev Number: 16 (DW_TAG_structure_type)
    <395>   DW_AT_byte_size   : 40
    <396>   DW_AT_decl_file   : 5
    <397>   DW_AT_decl_line   : 458
    <399>   DW_AT_decl_column : 9
    <399>   DW_AT_sibling     : <0x416>
 <2><39d>: Abbrev Number: 3 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0xcf53b): MODER
    <3a2>   DW_AT_decl_file   : 5
    <3a3>   DW_AT_decl_line   : 460
    <3a5>   DW_AT_decl_column : 17
    <3a6>   DW_AT_type        : <0x307>
    <3aa>   DW_AT_data_member_location: 0
 <2><3ab>: Abbrev Number: 3 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0xd0df9): OTYPER
    <3b0>   DW_AT_decl_file   : 5
    <3b1>   DW_AT_decl_line   : 461
    <3b3>   DW_AT_decl_column : 17
    <3b4>   DW_AT_type        : <0x307>
    <3b8>   DW_AT_data_member_location: 4
 <2><3b9>: Abbrev Number: 3 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0xd116e): OSPEEDR
    <3be>   DW_AT_decl_file   : 5
    <3bf>   DW_AT_decl_line   : 462
    <3c1>   DW_AT_decl_column : 17
    <3c2>   DW_AT_type        : <0x307>
    <3c6>   DW_AT_data_member_location: 8
 <2><3c7>: Abbrev Number: 3 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0xd09ed): PUPDR
    <3cc>   DW_AT_decl_file   : 5
    <3cd>   DW_AT_decl_line   : 463
    <3cf>   DW_AT_decl_column : 17
    <3d0>   DW_AT_type        : <0x307>
    <3d4>   DW_AT_data_member_location: 12
 <2><3d5>: Abbrev Number: 7 (DW_TAG_member)
    <3d6>   DW_AT_name        : IDR
    <3da>   DW_AT_decl_file   : 5
    <3da>   DW_AT_decl_line   : 464
    <3dc>   DW_AT_decl_column : 17
    <3dc>   DW_AT_type        : <0x307>
    <3e0>   DW_AT_data_member_location: 16
 <2><3e1>: Abbrev Number: 7 (DW_TAG_member)
    <3e2>   DW_AT_name        : ODR
    <3e6>   DW_AT_decl_file   : 5
    <3e6>   DW_AT_decl_line   : 465
    <3e8>   DW_AT_decl_column : 17
    <3e8>   DW_AT_type        : <0x307>
    <3ec>   DW_AT_data_member_location: 20
 <2><3ed>: Abbrev Number: 3 (DW_TAG_member)
    <3ee>   DW_AT_name        : (indirect string, offset: 0xcfc18): BSRR
    <3f2>   DW_AT_decl_file   : 5
    <3f3>   DW_AT_decl_line   : 466
    <3f5>   DW_AT_decl_column : 17
    <3f6>   DW_AT_type        : <0x307>
    <3fa>   DW_AT_data_member_location: 24
 <2><3fb>: Abbrev Number: 3 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0xd1132): LCKR
    <400>   DW_AT_decl_file   : 5
    <401>   DW_AT_decl_line   : 467
    <403>   DW_AT_decl_column : 17
    <404>   DW_AT_type        : <0x307>
    <408>   DW_AT_data_member_location: 28
 <2><409>: Abbrev Number: 7 (DW_TAG_member)
    <40a>   DW_AT_name        : AFR
    <40e>   DW_AT_decl_file   : 5
    <40e>   DW_AT_decl_line   : 468
    <410>   DW_AT_decl_column : 17
    <410>   DW_AT_type        : <0x38f>
    <414>   DW_AT_data_member_location: 32
 <2><415>: Abbrev Number: 0
 <1><416>: Abbrev Number: 12 (DW_TAG_typedef)
    <417>   DW_AT_name        : (indirect string, offset: 0xd147d): GPIO_TypeDef
    <41b>   DW_AT_decl_file   : 5
    <41c>   DW_AT_decl_line   : 469
    <41e>   DW_AT_decl_column : 3
    <41e>   DW_AT_type        : <0x394>
 <1><422>: Abbrev Number: 16 (DW_TAG_structure_type)
    <423>   DW_AT_byte_size   : 8
    <424>   DW_AT_decl_file   : 5
    <425>   DW_AT_decl_line   : 540
    <427>   DW_AT_decl_column : 9
    <427>   DW_AT_sibling     : <0x443>
 <2><42b>: Abbrev Number: 7 (DW_TAG_member)
    <42c>   DW_AT_name        : CR
    <42f>   DW_AT_decl_file   : 5
    <42f>   DW_AT_decl_line   : 542
    <431>   DW_AT_decl_column : 17
    <431>   DW_AT_type        : <0x307>
    <435>   DW_AT_data_member_location: 0
 <2><436>: Abbrev Number: 7 (DW_TAG_member)
    <437>   DW_AT_name        : CSR
    <43b>   DW_AT_decl_file   : 5
    <43b>   DW_AT_decl_line   : 543
    <43d>   DW_AT_decl_column : 17
    <43d>   DW_AT_type        : <0x307>
    <441>   DW_AT_data_member_location: 4
 <2><442>: Abbrev Number: 0
 <1><443>: Abbrev Number: 12 (DW_TAG_typedef)
    <444>   DW_AT_name        : (indirect string, offset: 0xd0cde): PWR_TypeDef
    <448>   DW_AT_decl_file   : 5
    <449>   DW_AT_decl_line   : 544
    <44b>   DW_AT_decl_column : 3
    <44b>   DW_AT_type        : <0x422>
 <1><44f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <450>   DW_AT_byte_size   : 152
    <451>   DW_AT_decl_file   : 5
    <452>   DW_AT_decl_line   : 550
    <454>   DW_AT_decl_column : 9
    <454>   DW_AT_sibling     : <0x62e>
 <2><458>: Abbrev Number: 7 (DW_TAG_member)
    <459>   DW_AT_name        : CR
    <45c>   DW_AT_decl_file   : 5
    <45c>   DW_AT_decl_line   : 552
    <45e>   DW_AT_decl_column : 17
    <45e>   DW_AT_type        : <0x307>
    <462>   DW_AT_data_member_location: 0
 <2><463>: Abbrev Number: 3 (DW_TAG_member)
    <464>   DW_AT_name        : (indirect string, offset: 0xd0c6a): PLLCFGR
    <468>   DW_AT_decl_file   : 5
    <469>   DW_AT_decl_line   : 553
    <46b>   DW_AT_decl_column : 17
    <46c>   DW_AT_type        : <0x307>
    <470>   DW_AT_data_member_location: 4
 <2><471>: Abbrev Number: 3 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0xd12a1): CFGR
    <476>   DW_AT_decl_file   : 5
    <477>   DW_AT_decl_line   : 554
    <479>   DW_AT_decl_column : 17
    <47a>   DW_AT_type        : <0x307>
    <47e>   DW_AT_data_member_location: 8
 <2><47f>: Abbrev Number: 7 (DW_TAG_member)
    <480>   DW_AT_name        : CIR
    <484>   DW_AT_decl_file   : 5
    <484>   DW_AT_decl_line   : 555
    <486>   DW_AT_decl_column : 17
    <486>   DW_AT_type        : <0x307>
    <48a>   DW_AT_data_member_location: 12
 <2><48b>: Abbrev Number: 3 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0xd0e59): AHB1RSTR
    <490>   DW_AT_decl_file   : 5
    <491>   DW_AT_decl_line   : 556
    <493>   DW_AT_decl_column : 17
    <494>   DW_AT_type        : <0x307>
    <498>   DW_AT_data_member_location: 16
 <2><499>: Abbrev Number: 3 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0xcf721): AHB2RSTR
    <49e>   DW_AT_decl_file   : 5
    <49f>   DW_AT_decl_line   : 557
    <4a1>   DW_AT_decl_column : 17
    <4a2>   DW_AT_type        : <0x307>
    <4a6>   DW_AT_data_member_location: 20
 <2><4a7>: Abbrev Number: 3 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xd01a8): AHB3RSTR
    <4ac>   DW_AT_decl_file   : 5
    <4ad>   DW_AT_decl_line   : 558
    <4af>   DW_AT_decl_column : 17
    <4b0>   DW_AT_type        : <0x307>
    <4b4>   DW_AT_data_member_location: 24
 <2><4b5>: Abbrev Number: 3 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0xc2a6f): RESERVED0
    <4ba>   DW_AT_decl_file   : 5
    <4bb>   DW_AT_decl_line   : 559
    <4bd>   DW_AT_decl_column : 17
    <4be>   DW_AT_type        : <0x2fb>
    <4c2>   DW_AT_data_member_location: 28
 <2><4c3>: Abbrev Number: 3 (DW_TAG_member)
    <4c4>   DW_AT_name        : (indirect string, offset: 0xcf718): APB1RSTR
    <4c8>   DW_AT_decl_file   : 5
    <4c9>   DW_AT_decl_line   : 560
    <4cb>   DW_AT_decl_column : 17
    <4cc>   DW_AT_type        : <0x307>
    <4d0>   DW_AT_data_member_location: 32
 <2><4d1>: Abbrev Number: 3 (DW_TAG_member)
    <4d2>   DW_AT_name        : (indirect string, offset: 0xd0198): APB2RSTR
    <4d6>   DW_AT_decl_file   : 5
    <4d7>   DW_AT_decl_line   : 561
    <4d9>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0x307>
    <4de>   DW_AT_data_member_location: 36
 <2><4df>: Abbrev Number: 3 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0xc2a79): RESERVED1
    <4e4>   DW_AT_decl_file   : 5
    <4e5>   DW_AT_decl_line   : 562
    <4e7>   DW_AT_decl_column : 17
    <4e8>   DW_AT_type        : <0x30c>
    <4ec>   DW_AT_data_member_location: 40
 <2><4ed>: Abbrev Number: 3 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0xcf6aa): AHB1ENR
    <4f2>   DW_AT_decl_file   : 5
    <4f3>   DW_AT_decl_line   : 563
    <4f5>   DW_AT_decl_column : 17
    <4f6>   DW_AT_type        : <0x307>
    <4fa>   DW_AT_data_member_location: 48
 <2><4fb>: Abbrev Number: 3 (DW_TAG_member)
    <4fc>   DW_AT_name        : (indirect string, offset: 0xcfd00): AHB2ENR
    <500>   DW_AT_decl_file   : 5
    <501>   DW_AT_decl_line   : 564
    <503>   DW_AT_decl_column : 17
    <504>   DW_AT_type        : <0x307>
    <508>   DW_AT_data_member_location: 52
 <2><509>: Abbrev Number: 3 (DW_TAG_member)
    <50a>   DW_AT_name        : (indirect string, offset: 0xd01f7): AHB3ENR
    <50e>   DW_AT_decl_file   : 5
    <50f>   DW_AT_decl_line   : 565
    <511>   DW_AT_decl_column : 17
    <512>   DW_AT_type        : <0x307>
    <516>   DW_AT_data_member_location: 56
 <2><517>: Abbrev Number: 3 (DW_TAG_member)
    <518>   DW_AT_name        : (indirect string, offset: 0xc2a83): RESERVED2
    <51c>   DW_AT_decl_file   : 5
    <51d>   DW_AT_decl_line   : 566
    <51f>   DW_AT_decl_column : 17
    <520>   DW_AT_type        : <0x2fb>
    <524>   DW_AT_data_member_location: 60
 <2><525>: Abbrev Number: 3 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0xd0677): APB1ENR
    <52a>   DW_AT_decl_file   : 5
    <52b>   DW_AT_decl_line   : 567
    <52d>   DW_AT_decl_column : 17
    <52e>   DW_AT_type        : <0x307>
    <532>   DW_AT_data_member_location: 64
 <2><533>: Abbrev Number: 3 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0xcf75b): APB2ENR
    <538>   DW_AT_decl_file   : 5
    <539>   DW_AT_decl_line   : 568
    <53b>   DW_AT_decl_column : 17
    <53c>   DW_AT_type        : <0x307>
    <540>   DW_AT_data_member_location: 68
 <2><541>: Abbrev Number: 3 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0xd138b): RESERVED3
    <546>   DW_AT_decl_file   : 5
    <547>   DW_AT_decl_line   : 569
    <549>   DW_AT_decl_column : 17
    <54a>   DW_AT_type        : <0x30c>
    <54e>   DW_AT_data_member_location: 72
 <2><54f>: Abbrev Number: 3 (DW_TAG_member)
    <550>   DW_AT_name        : (indirect string, offset: 0xd0ec6): AHB1LPENR
    <554>   DW_AT_decl_file   : 5
    <555>   DW_AT_decl_line   : 570
    <557>   DW_AT_decl_column : 17
    <558>   DW_AT_type        : <0x307>
    <55c>   DW_AT_data_member_location: 80
 <2><55d>: Abbrev Number: 3 (DW_TAG_member)
    <55e>   DW_AT_name        : (indirect string, offset: 0xcfbe7): AHB2LPENR
    <562>   DW_AT_decl_file   : 5
    <563>   DW_AT_decl_line   : 571
    <565>   DW_AT_decl_column : 17
    <566>   DW_AT_type        : <0x307>
    <56a>   DW_AT_data_member_location: 84
 <2><56b>: Abbrev Number: 3 (DW_TAG_member)
    <56c>   DW_AT_name        : (indirect string, offset: 0xd0b94): AHB3LPENR
    <570>   DW_AT_decl_file   : 5
    <571>   DW_AT_decl_line   : 572
    <573>   DW_AT_decl_column : 17
    <574>   DW_AT_type        : <0x307>
    <578>   DW_AT_data_member_location: 88
 <2><579>: Abbrev Number: 3 (DW_TAG_member)
    <57a>   DW_AT_name        : (indirect string, offset: 0xd1395): RESERVED4
    <57e>   DW_AT_decl_file   : 5
    <57f>   DW_AT_decl_line   : 573
    <581>   DW_AT_decl_column : 17
    <582>   DW_AT_type        : <0x2fb>
    <586>   DW_AT_data_member_location: 92
 <2><587>: Abbrev Number: 3 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0xd0fd5): APB1LPENR
    <58c>   DW_AT_decl_file   : 5
    <58d>   DW_AT_decl_line   : 574
    <58f>   DW_AT_decl_column : 17
    <590>   DW_AT_type        : <0x307>
    <594>   DW_AT_data_member_location: 96
 <2><595>: Abbrev Number: 3 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0xcf8c1): APB2LPENR
    <59a>   DW_AT_decl_file   : 5
    <59b>   DW_AT_decl_line   : 575
    <59d>   DW_AT_decl_column : 17
    <59e>   DW_AT_type        : <0x307>
    <5a2>   DW_AT_data_member_location: 100
 <2><5a3>: Abbrev Number: 3 (DW_TAG_member)
    <5a4>   DW_AT_name        : (indirect string, offset: 0xd139f): RESERVED5
    <5a8>   DW_AT_decl_file   : 5
    <5a9>   DW_AT_decl_line   : 576
    <5ab>   DW_AT_decl_column : 17
    <5ac>   DW_AT_type        : <0x30c>
    <5b0>   DW_AT_data_member_location: 104
 <2><5b1>: Abbrev Number: 3 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0xd00ab): BDCR
    <5b6>   DW_AT_decl_file   : 5
    <5b7>   DW_AT_decl_line   : 577
    <5b9>   DW_AT_decl_column : 17
    <5ba>   DW_AT_type        : <0x307>
    <5be>   DW_AT_data_member_location: 112
 <2><5bf>: Abbrev Number: 7 (DW_TAG_member)
    <5c0>   DW_AT_name        : CSR
    <5c4>   DW_AT_decl_file   : 5
    <5c4>   DW_AT_decl_line   : 578
    <5c6>   DW_AT_decl_column : 17
    <5c6>   DW_AT_type        : <0x307>
    <5ca>   DW_AT_data_member_location: 116
 <2><5cb>: Abbrev Number: 3 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0xd076e): RESERVED6
    <5d0>   DW_AT_decl_file   : 5
    <5d1>   DW_AT_decl_line   : 579
    <5d3>   DW_AT_decl_column : 17
    <5d4>   DW_AT_type        : <0x30c>
    <5d8>   DW_AT_data_member_location: 120
 <2><5d9>: Abbrev Number: 3 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0xd04eb): SSCGR
    <5de>   DW_AT_decl_file   : 5
    <5df>   DW_AT_decl_line   : 580
    <5e1>   DW_AT_decl_column : 17
    <5e2>   DW_AT_type        : <0x307>
    <5e6>   DW_AT_data_member_location: 128
 <2><5e7>: Abbrev Number: 3 (DW_TAG_member)
    <5e8>   DW_AT_name        : (indirect string, offset: 0xcff65): PLLI2SCFGR
    <5ec>   DW_AT_decl_file   : 5
    <5ed>   DW_AT_decl_line   : 581
    <5ef>   DW_AT_decl_column : 17
    <5f0>   DW_AT_type        : <0x307>
    <5f4>   DW_AT_data_member_location: 132
 <2><5f5>: Abbrev Number: 3 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xd129b): PLLSAICFGR
    <5fa>   DW_AT_decl_file   : 5
    <5fb>   DW_AT_decl_line   : 582
    <5fd>   DW_AT_decl_column : 17
    <5fe>   DW_AT_type        : <0x307>
    <602>   DW_AT_data_member_location: 136
 <2><603>: Abbrev Number: 3 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0xd01b1): DCKCFGR
    <608>   DW_AT_decl_file   : 5
    <609>   DW_AT_decl_line   : 583
    <60b>   DW_AT_decl_column : 17
    <60c>   DW_AT_type        : <0x307>
    <610>   DW_AT_data_member_location: 140
 <2><611>: Abbrev Number: 3 (DW_TAG_member)
    <612>   DW_AT_name        : (indirect string, offset: 0xd0df0): CKGATENR
    <616>   DW_AT_decl_file   : 5
    <617>   DW_AT_decl_line   : 584
    <619>   DW_AT_decl_column : 17
    <61a>   DW_AT_type        : <0x307>
    <61e>   DW_AT_data_member_location: 144
 <2><61f>: Abbrev Number: 3 (DW_TAG_member)
    <620>   DW_AT_name        : (indirect string, offset: 0xd0c07): DCKCFGR2
    <624>   DW_AT_decl_file   : 5
    <625>   DW_AT_decl_line   : 585
    <627>   DW_AT_decl_column : 17
    <628>   DW_AT_type        : <0x307>
    <62c>   DW_AT_data_member_location: 148
 <2><62d>: Abbrev Number: 0
 <1><62e>: Abbrev Number: 12 (DW_TAG_typedef)
    <62f>   DW_AT_name        : (indirect string, offset: 0xd0266): RCC_TypeDef
    <633>   DW_AT_decl_file   : 5
    <634>   DW_AT_decl_line   : 586
    <636>   DW_AT_decl_column : 3
    <636>   DW_AT_type        : <0x44f>
 <1><63a>: Abbrev Number: 16 (DW_TAG_structure_type)
    <63b>   DW_AT_byte_size   : 84
    <63c>   DW_AT_decl_file   : 5
    <63d>   DW_AT_decl_line   : 745
    <63f>   DW_AT_decl_column : 9
    <63f>   DW_AT_sibling     : <0x754>
 <2><643>: Abbrev Number: 7 (DW_TAG_member)
    <644>   DW_AT_name        : CR1
    <648>   DW_AT_decl_file   : 5
    <648>   DW_AT_decl_line   : 747
    <64a>   DW_AT_decl_column : 17
    <64a>   DW_AT_type        : <0x307>
    <64e>   DW_AT_data_member_location: 0
 <2><64f>: Abbrev Number: 7 (DW_TAG_member)
    <650>   DW_AT_name        : CR2
    <654>   DW_AT_decl_file   : 5
    <654>   DW_AT_decl_line   : 748
    <656>   DW_AT_decl_column : 17
    <656>   DW_AT_type        : <0x307>
    <65a>   DW_AT_data_member_location: 4
 <2><65b>: Abbrev Number: 3 (DW_TAG_member)
    <65c>   DW_AT_name        : (indirect string, offset: 0x3be98): SMCR
    <660>   DW_AT_decl_file   : 5
    <661>   DW_AT_decl_line   : 749
    <663>   DW_AT_decl_column : 17
    <664>   DW_AT_type        : <0x307>
    <668>   DW_AT_data_member_location: 8
 <2><669>: Abbrev Number: 3 (DW_TAG_member)
    <66a>   DW_AT_name        : (indirect string, offset: 0x42073): DIER
    <66e>   DW_AT_decl_file   : 5
    <66f>   DW_AT_decl_line   : 750
    <671>   DW_AT_decl_column : 17
    <672>   DW_AT_type        : <0x307>
    <676>   DW_AT_data_member_location: 12
 <2><677>: Abbrev Number: 7 (DW_TAG_member)
    <678>   DW_AT_name        : SR
    <67b>   DW_AT_decl_file   : 5
    <67b>   DW_AT_decl_line   : 751
    <67d>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x307>
    <681>   DW_AT_data_member_location: 16
 <2><682>: Abbrev Number: 7 (DW_TAG_member)
    <683>   DW_AT_name        : EGR
    <687>   DW_AT_decl_file   : 5
    <687>   DW_AT_decl_line   : 752
    <689>   DW_AT_decl_column : 17
    <689>   DW_AT_type        : <0x307>
    <68d>   DW_AT_data_member_location: 20
 <2><68e>: Abbrev Number: 3 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0xbc194): CCMR1
    <693>   DW_AT_decl_file   : 5
    <694>   DW_AT_decl_line   : 753
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x307>
    <69b>   DW_AT_data_member_location: 24
 <2><69c>: Abbrev Number: 3 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0x511b6): CCMR2
    <6a1>   DW_AT_decl_file   : 5
    <6a2>   DW_AT_decl_line   : 754
    <6a4>   DW_AT_decl_column : 17
    <6a5>   DW_AT_type        : <0x307>
    <6a9>   DW_AT_data_member_location: 28
 <2><6aa>: Abbrev Number: 3 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x31b0d): CCER
    <6af>   DW_AT_decl_file   : 5
    <6b0>   DW_AT_decl_line   : 755
    <6b2>   DW_AT_decl_column : 17
    <6b3>   DW_AT_type        : <0x307>
    <6b7>   DW_AT_data_member_location: 32
 <2><6b8>: Abbrev Number: 7 (DW_TAG_member)
    <6b9>   DW_AT_name        : CNT
    <6bd>   DW_AT_decl_file   : 5
    <6bd>   DW_AT_decl_line   : 756
    <6bf>   DW_AT_decl_column : 17
    <6bf>   DW_AT_type        : <0x307>
    <6c3>   DW_AT_data_member_location: 36
 <2><6c4>: Abbrev Number: 7 (DW_TAG_member)
    <6c5>   DW_AT_name        : PSC
    <6c9>   DW_AT_decl_file   : 5
    <6c9>   DW_AT_decl_line   : 757
    <6cb>   DW_AT_decl_column : 17
    <6cb>   DW_AT_type        : <0x307>
    <6cf>   DW_AT_data_member_location: 40
 <2><6d0>: Abbrev Number: 7 (DW_TAG_member)
    <6d1>   DW_AT_name        : ARR
    <6d5>   DW_AT_decl_file   : 5
    <6d5>   DW_AT_decl_line   : 758
    <6d7>   DW_AT_decl_column : 17
    <6d7>   DW_AT_type        : <0x307>
    <6db>   DW_AT_data_member_location: 44
 <2><6dc>: Abbrev Number: 7 (DW_TAG_member)
    <6dd>   DW_AT_name        : RCR
    <6e1>   DW_AT_decl_file   : 5
    <6e1>   DW_AT_decl_line   : 759
    <6e3>   DW_AT_decl_column : 17
    <6e3>   DW_AT_type        : <0x307>
    <6e7>   DW_AT_data_member_location: 48
 <2><6e8>: Abbrev Number: 3 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0x19162): CCR1
    <6ed>   DW_AT_decl_file   : 5
    <6ee>   DW_AT_decl_line   : 760
    <6f0>   DW_AT_decl_column : 17
    <6f1>   DW_AT_type        : <0x307>
    <6f5>   DW_AT_data_member_location: 52
 <2><6f6>: Abbrev Number: 3 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x55273): CCR2
    <6fb>   DW_AT_decl_file   : 5
    <6fc>   DW_AT_decl_line   : 761
    <6fe>   DW_AT_decl_column : 17
    <6ff>   DW_AT_type        : <0x307>
    <703>   DW_AT_data_member_location: 56
 <2><704>: Abbrev Number: 3 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x9da39): CCR3
    <709>   DW_AT_decl_file   : 5
    <70a>   DW_AT_decl_line   : 762
    <70c>   DW_AT_decl_column : 17
    <70d>   DW_AT_type        : <0x307>
    <711>   DW_AT_data_member_location: 60
 <2><712>: Abbrev Number: 3 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xd17e): CCR4
    <717>   DW_AT_decl_file   : 5
    <718>   DW_AT_decl_line   : 763
    <71a>   DW_AT_decl_column : 17
    <71b>   DW_AT_type        : <0x307>
    <71f>   DW_AT_data_member_location: 64
 <2><720>: Abbrev Number: 3 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x55e6f): BDTR
    <725>   DW_AT_decl_file   : 5
    <726>   DW_AT_decl_line   : 764
    <728>   DW_AT_decl_column : 17
    <729>   DW_AT_type        : <0x307>
    <72d>   DW_AT_data_member_location: 68
 <2><72e>: Abbrev Number: 7 (DW_TAG_member)
    <72f>   DW_AT_name        : DCR
    <733>   DW_AT_decl_file   : 5
    <733>   DW_AT_decl_line   : 765
    <735>   DW_AT_decl_column : 17
    <735>   DW_AT_type        : <0x307>
    <739>   DW_AT_data_member_location: 72
 <2><73a>: Abbrev Number: 3 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0xb138e): DMAR
    <73f>   DW_AT_decl_file   : 5
    <740>   DW_AT_decl_line   : 766
    <742>   DW_AT_decl_column : 17
    <743>   DW_AT_type        : <0x307>
    <747>   DW_AT_data_member_location: 76
 <2><748>: Abbrev Number: 7 (DW_TAG_member)
    <749>   DW_AT_name        : OR
    <74c>   DW_AT_decl_file   : 5
    <74c>   DW_AT_decl_line   : 767
    <74e>   DW_AT_decl_column : 17
    <74e>   DW_AT_type        : <0x307>
    <752>   DW_AT_data_member_location: 80
 <2><753>: Abbrev Number: 0
 <1><754>: Abbrev Number: 12 (DW_TAG_typedef)
    <755>   DW_AT_name        : (indirect string, offset: 0xd13a9): TIM_TypeDef
    <759>   DW_AT_decl_file   : 5
    <75a>   DW_AT_decl_line   : 768
    <75c>   DW_AT_decl_column : 3
    <75c>   DW_AT_type        : <0x63a>
 <1><760>: Abbrev Number: 16 (DW_TAG_structure_type)
    <761>   DW_AT_byte_size   : 28
    <762>   DW_AT_decl_file   : 5
    <763>   DW_AT_decl_line   : 774
    <765>   DW_AT_decl_column : 9
    <765>   DW_AT_sibling     : <0x7be>
 <2><769>: Abbrev Number: 7 (DW_TAG_member)
    <76a>   DW_AT_name        : SR
    <76d>   DW_AT_decl_file   : 5
    <76d>   DW_AT_decl_line   : 776
    <76f>   DW_AT_decl_column : 17
    <76f>   DW_AT_type        : <0x307>
    <773>   DW_AT_data_member_location: 0
 <2><774>: Abbrev Number: 7 (DW_TAG_member)
    <775>   DW_AT_name        : DR
    <778>   DW_AT_decl_file   : 5
    <778>   DW_AT_decl_line   : 777
    <77a>   DW_AT_decl_column : 17
    <77a>   DW_AT_type        : <0x307>
    <77e>   DW_AT_data_member_location: 4
 <2><77f>: Abbrev Number: 7 (DW_TAG_member)
    <780>   DW_AT_name        : BRR
    <784>   DW_AT_decl_file   : 5
    <784>   DW_AT_decl_line   : 778
    <786>   DW_AT_decl_column : 17
    <786>   DW_AT_type        : <0x307>
    <78a>   DW_AT_data_member_location: 8
 <2><78b>: Abbrev Number: 7 (DW_TAG_member)
    <78c>   DW_AT_name        : CR1
    <790>   DW_AT_decl_file   : 5
    <790>   DW_AT_decl_line   : 779
    <792>   DW_AT_decl_column : 17
    <792>   DW_AT_type        : <0x307>
    <796>   DW_AT_data_member_location: 12
 <2><797>: Abbrev Number: 7 (DW_TAG_member)
    <798>   DW_AT_name        : CR2
    <79c>   DW_AT_decl_file   : 5
    <79c>   DW_AT_decl_line   : 780
    <79e>   DW_AT_decl_column : 17
    <79e>   DW_AT_type        : <0x307>
    <7a2>   DW_AT_data_member_location: 16
 <2><7a3>: Abbrev Number: 7 (DW_TAG_member)
    <7a4>   DW_AT_name        : CR3
    <7a8>   DW_AT_decl_file   : 5
    <7a8>   DW_AT_decl_line   : 781
    <7aa>   DW_AT_decl_column : 17
    <7aa>   DW_AT_type        : <0x307>
    <7ae>   DW_AT_data_member_location: 20
 <2><7af>: Abbrev Number: 3 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0xcfd37): GTPR
    <7b4>   DW_AT_decl_file   : 5
    <7b5>   DW_AT_decl_line   : 782
    <7b7>   DW_AT_decl_column : 17
    <7b8>   DW_AT_type        : <0x307>
    <7bc>   DW_AT_data_member_location: 24
 <2><7bd>: Abbrev Number: 0
 <1><7be>: Abbrev Number: 12 (DW_TAG_typedef)
    <7bf>   DW_AT_name        : (indirect string, offset: 0xcf69c): USART_TypeDef
    <7c3>   DW_AT_decl_file   : 5
    <7c4>   DW_AT_decl_line   : 783
    <7c6>   DW_AT_decl_column : 3
    <7c6>   DW_AT_type        : <0x760>
 <1><7ca>: Abbrev Number: 11 (DW_TAG_base_type)
    <7cb>   DW_AT_byte_size   : 8
    <7cc>   DW_AT_encoding    : 4	(float)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x13083): long double
 <1><7d1>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <7d2>   DW_AT_encoding    : 7	(unsigned)
    <7d3>   DW_AT_byte_size   : 1
    <7d4>   DW_AT_type        : <0x282>
    <7d8>   DW_AT_decl_file   : 6
    <7d9>   DW_AT_decl_line   : 39
    <7da>   DW_AT_decl_column : 1
    <7db>   DW_AT_sibling     : <0x7f8>
 <2><7df>: Abbrev Number: 2 (DW_TAG_enumerator)
    <7e0>   DW_AT_name        : (indirect string, offset: 0xcffae): HAL_OK
    <7e4>   DW_AT_const_value : 0
 <2><7e5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <7e6>   DW_AT_name        : (indirect string, offset: 0xd0815): HAL_ERROR
    <7ea>   DW_AT_const_value : 1
 <2><7eb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <7ec>   DW_AT_name        : (indirect string, offset: 0xcf8f9): HAL_BUSY
    <7f0>   DW_AT_const_value : 2
 <2><7f1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xcfd76): HAL_TIMEOUT
    <7f6>   DW_AT_const_value : 3
 <2><7f7>: Abbrev Number: 0
 <1><7f8>: Abbrev Number: 5 (DW_TAG_typedef)
    <7f9>   DW_AT_name        : (indirect string, offset: 0xcf564): HAL_StatusTypeDef
    <7fd>   DW_AT_decl_file   : 6
    <7fe>   DW_AT_decl_line   : 44
    <7ff>   DW_AT_decl_column : 3
    <800>   DW_AT_type        : <0x7d1>
 <1><804>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <805>   DW_AT_encoding    : 7	(unsigned)
    <806>   DW_AT_byte_size   : 1
    <807>   DW_AT_type        : <0x282>
    <80b>   DW_AT_decl_file   : 6
    <80c>   DW_AT_decl_line   : 50
    <80d>   DW_AT_decl_column : 1
    <80e>   DW_AT_sibling     : <0x81f>
 <2><812>: Abbrev Number: 2 (DW_TAG_enumerator)
    <813>   DW_AT_name        : (indirect string, offset: 0xd0d4a): HAL_UNLOCKED
    <817>   DW_AT_const_value : 0
 <2><818>: Abbrev Number: 2 (DW_TAG_enumerator)
    <819>   DW_AT_name        : (indirect string, offset: 0xd15b9): HAL_LOCKED
    <81d>   DW_AT_const_value : 1
 <2><81e>: Abbrev Number: 0
 <1><81f>: Abbrev Number: 5 (DW_TAG_typedef)
    <820>   DW_AT_name        : (indirect string, offset: 0xd075e): HAL_LockTypeDef
    <824>   DW_AT_decl_file   : 6
    <825>   DW_AT_decl_line   : 53
    <826>   DW_AT_decl_column : 3
    <827>   DW_AT_type        : <0x804>
 <1><82b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <82c>   DW_AT_byte_size   : 28
    <82d>   DW_AT_decl_file   : 7
    <82e>   DW_AT_decl_line   : 45
    <82f>   DW_AT_decl_column : 9
    <82f>   DW_AT_sibling     : <0x88f>
 <2><833>: Abbrev Number: 1 (DW_TAG_member)
    <834>   DW_AT_name        : (indirect string, offset: 0xd0b56): PLLState
    <838>   DW_AT_decl_file   : 7
    <839>   DW_AT_decl_line   : 47
    <83a>   DW_AT_decl_column : 12
    <83b>   DW_AT_type        : <0x2fb>
    <83f>   DW_AT_data_member_location: 0
 <2><840>: Abbrev Number: 1 (DW_TAG_member)
    <841>   DW_AT_name        : (indirect string, offset: 0xd0c10): PLLSource
    <845>   DW_AT_decl_file   : 7
    <846>   DW_AT_decl_line   : 50
    <847>   DW_AT_decl_column : 12
    <848>   DW_AT_type        : <0x2fb>
    <84c>   DW_AT_data_member_location: 4
 <2><84d>: Abbrev Number: 1 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0xd0f3d): PLLM
    <852>   DW_AT_decl_file   : 7
    <853>   DW_AT_decl_line   : 53
    <854>   DW_AT_decl_column : 12
    <855>   DW_AT_type        : <0x2fb>
    <859>   DW_AT_data_member_location: 8
 <2><85a>: Abbrev Number: 1 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0xd0f42): PLLN
    <85f>   DW_AT_decl_file   : 7
    <860>   DW_AT_decl_line   : 56
    <861>   DW_AT_decl_column : 12
    <862>   DW_AT_type        : <0x2fb>
    <866>   DW_AT_data_member_location: 12
 <2><867>: Abbrev Number: 1 (DW_TAG_member)
    <868>   DW_AT_name        : (indirect string, offset: 0xd0f47): PLLP
    <86c>   DW_AT_decl_file   : 7
    <86d>   DW_AT_decl_line   : 60
    <86e>   DW_AT_decl_column : 12
    <86f>   DW_AT_type        : <0x2fb>
    <873>   DW_AT_data_member_location: 16
 <2><874>: Abbrev Number: 1 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x4b8ed): PLLQ
    <879>   DW_AT_decl_file   : 7
    <87a>   DW_AT_decl_line   : 63
    <87b>   DW_AT_decl_column : 12
    <87c>   DW_AT_type        : <0x2fb>
    <880>   DW_AT_data_member_location: 20
 <2><881>: Abbrev Number: 1 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0xd09f3): PLLR
    <886>   DW_AT_decl_file   : 7
    <887>   DW_AT_decl_line   : 68
    <888>   DW_AT_decl_column : 12
    <889>   DW_AT_type        : <0x2fb>
    <88d>   DW_AT_data_member_location: 24
 <2><88e>: Abbrev Number: 0
 <1><88f>: Abbrev Number: 5 (DW_TAG_typedef)
    <890>   DW_AT_name        : (indirect string, offset: 0xd07be): RCC_PLLInitTypeDef
    <894>   DW_AT_decl_file   : 7
    <895>   DW_AT_decl_line   : 73
    <896>   DW_AT_decl_column : 2
    <897>   DW_AT_type        : <0x82b>
 <1><89b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <89c>   DW_AT_byte_size   : 52
    <89d>   DW_AT_decl_file   : 8
    <89e>   DW_AT_decl_line   : 49
    <89f>   DW_AT_decl_column : 9
    <89f>   DW_AT_sibling     : <0x8ff>
 <2><8a3>: Abbrev Number: 1 (DW_TAG_member)
    <8a4>   DW_AT_name        : (indirect string, offset: 0xd0ea6): OscillatorType
    <8a8>   DW_AT_decl_file   : 8
    <8a9>   DW_AT_decl_line   : 51
    <8aa>   DW_AT_decl_column : 12
    <8ab>   DW_AT_type        : <0x2fb>
    <8af>   DW_AT_data_member_location: 0
 <2><8b0>: Abbrev Number: 1 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xd0b9e): HSEState
    <8b5>   DW_AT_decl_file   : 8
    <8b6>   DW_AT_decl_line   : 54
    <8b7>   DW_AT_decl_column : 12
    <8b8>   DW_AT_type        : <0x2fb>
    <8bc>   DW_AT_data_member_location: 4
 <2><8bd>: Abbrev Number: 1 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0xd08da): LSEState
    <8c2>   DW_AT_decl_file   : 8
    <8c3>   DW_AT_decl_line   : 57
    <8c4>   DW_AT_decl_column : 12
    <8c5>   DW_AT_type        : <0x2fb>
    <8c9>   DW_AT_data_member_location: 8
 <2><8ca>: Abbrev Number: 1 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xd01dc): HSIState
    <8cf>   DW_AT_decl_file   : 8
    <8d0>   DW_AT_decl_line   : 60
    <8d1>   DW_AT_decl_column : 12
    <8d2>   DW_AT_type        : <0x2fb>
    <8d6>   DW_AT_data_member_location: 12
 <2><8d7>: Abbrev Number: 1 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xd1137): HSICalibrationValue
    <8dc>   DW_AT_decl_file   : 8
    <8dd>   DW_AT_decl_line   : 63
    <8de>   DW_AT_decl_column : 12
    <8df>   DW_AT_type        : <0x2fb>
    <8e3>   DW_AT_data_member_location: 16
 <2><8e4>: Abbrev Number: 1 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xd0063): LSIState
    <8e9>   DW_AT_decl_file   : 8
    <8ea>   DW_AT_decl_line   : 66
    <8eb>   DW_AT_decl_column : 12
    <8ec>   DW_AT_type        : <0x2fb>
    <8f0>   DW_AT_data_member_location: 20
 <2><8f1>: Abbrev Number: 30 (DW_TAG_member)
    <8f2>   DW_AT_name        : PLL
    <8f6>   DW_AT_decl_file   : 8
    <8f7>   DW_AT_decl_line   : 69
    <8f8>   DW_AT_decl_column : 22
    <8f9>   DW_AT_type        : <0x88f>
    <8fd>   DW_AT_data_member_location: 24
 <2><8fe>: Abbrev Number: 0
 <1><8ff>: Abbrev Number: 5 (DW_TAG_typedef)
    <900>   DW_AT_name        : (indirect string, offset: 0xd04f1): RCC_OscInitTypeDef
    <904>   DW_AT_decl_file   : 8
    <905>   DW_AT_decl_line   : 70
    <906>   DW_AT_decl_column : 2
    <907>   DW_AT_type        : <0x89b>
 <1><90b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <90c>   DW_AT_byte_size   : 20
    <90d>   DW_AT_decl_file   : 8
    <90e>   DW_AT_decl_line   : 75
    <90f>   DW_AT_decl_column : 9
    <90f>   DW_AT_sibling     : <0x955>
 <2><913>: Abbrev Number: 1 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0xcfeee): ClockType
    <918>   DW_AT_decl_file   : 8
    <919>   DW_AT_decl_line   : 77
    <91a>   DW_AT_decl_column : 12
    <91b>   DW_AT_type        : <0x2fb>
    <91f>   DW_AT_data_member_location: 0
 <2><920>: Abbrev Number: 1 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0xd07b1): SYSCLKSource
    <925>   DW_AT_decl_file   : 8
    <926>   DW_AT_decl_line   : 80
    <927>   DW_AT_decl_column : 12
    <928>   DW_AT_type        : <0x2fb>
    <92c>   DW_AT_data_member_location: 4
 <2><92d>: Abbrev Number: 1 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0xd0f21): AHBCLKDivider
    <932>   DW_AT_decl_file   : 8
    <933>   DW_AT_decl_line   : 83
    <934>   DW_AT_decl_column : 12
    <935>   DW_AT_type        : <0x2fb>
    <939>   DW_AT_data_member_location: 8
 <2><93a>: Abbrev Number: 1 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0xcf626): APB1CLKDivider
    <93f>   DW_AT_decl_file   : 8
    <940>   DW_AT_decl_line   : 86
    <941>   DW_AT_decl_column : 12
    <942>   DW_AT_type        : <0x2fb>
    <946>   DW_AT_data_member_location: 12
 <2><947>: Abbrev Number: 1 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0xd0227): APB2CLKDivider
    <94c>   DW_AT_decl_file   : 8
    <94d>   DW_AT_decl_line   : 89
    <94e>   DW_AT_decl_column : 12
    <94f>   DW_AT_type        : <0x2fb>
    <953>   DW_AT_data_member_location: 16
 <2><954>: Abbrev Number: 0
 <1><955>: Abbrev Number: 5 (DW_TAG_typedef)
    <956>   DW_AT_name        : (indirect string, offset: 0xd0c57): RCC_ClkInitTypeDef
    <95a>   DW_AT_decl_file   : 8
    <95b>   DW_AT_decl_line   : 92
    <95c>   DW_AT_decl_column : 2
    <95d>   DW_AT_type        : <0x90b>
 <1><961>: Abbrev Number: 15 (DW_TAG_structure_type)
    <962>   DW_AT_byte_size   : 20
    <963>   DW_AT_decl_file   : 9
    <964>   DW_AT_decl_line   : 46
    <965>   DW_AT_decl_column : 9
    <965>   DW_AT_sibling     : <0x9ab>
 <2><969>: Abbrev Number: 30 (DW_TAG_member)
    <96a>   DW_AT_name        : Pin
    <96e>   DW_AT_decl_file   : 9
    <96f>   DW_AT_decl_line   : 48
    <970>   DW_AT_decl_column : 12
    <971>   DW_AT_type        : <0x2fb>
    <975>   DW_AT_data_member_location: 0
 <2><976>: Abbrev Number: 1 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0xd01a3): Mode
    <97b>   DW_AT_decl_file   : 9
    <97c>   DW_AT_decl_line   : 51
    <97d>   DW_AT_decl_column : 12
    <97e>   DW_AT_type        : <0x2fb>
    <982>   DW_AT_data_member_location: 4
 <2><983>: Abbrev Number: 1 (DW_TAG_member)
    <984>   DW_AT_name        : (indirect string, offset: 0xd0431): Pull
    <988>   DW_AT_decl_file   : 9
    <989>   DW_AT_decl_line   : 54
    <98a>   DW_AT_decl_column : 12
    <98b>   DW_AT_type        : <0x2fb>
    <98f>   DW_AT_data_member_location: 8
 <2><990>: Abbrev Number: 1 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0xd0713): Speed
    <995>   DW_AT_decl_file   : 9
    <996>   DW_AT_decl_line   : 57
    <997>   DW_AT_decl_column : 12
    <998>   DW_AT_type        : <0x2fb>
    <99c>   DW_AT_data_member_location: 12
 <2><99d>: Abbrev Number: 1 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0xd021d): Alternate
    <9a2>   DW_AT_decl_file   : 9
    <9a3>   DW_AT_decl_line   : 60
    <9a4>   DW_AT_decl_column : 12
    <9a5>   DW_AT_type        : <0x2fb>
    <9a9>   DW_AT_data_member_location: 16
 <2><9aa>: Abbrev Number: 0
 <1><9ab>: Abbrev Number: 5 (DW_TAG_typedef)
    <9ac>   DW_AT_name        : (indirect string, offset: 0xd0e15): GPIO_InitTypeDef
    <9b0>   DW_AT_decl_file   : 9
    <9b1>   DW_AT_decl_line   : 62
    <9b2>   DW_AT_decl_column : 2
    <9b3>   DW_AT_type        : <0x961>
 <1><9b7>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <9b8>   DW_AT_encoding    : 7	(unsigned)
    <9b9>   DW_AT_byte_size   : 1
    <9ba>   DW_AT_type        : <0x282>
    <9be>   DW_AT_decl_file   : 9
    <9bf>   DW_AT_decl_line   : 68
    <9c0>   DW_AT_decl_column : 1
    <9c1>   DW_AT_sibling     : <0x9d2>
 <2><9c5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9c6>   DW_AT_name        : (indirect string, offset: 0xcfb7b): GPIO_PIN_RESET
    <9ca>   DW_AT_const_value : 0
 <2><9cb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9cc>   DW_AT_name        : (indirect string, offset: 0xcfcbf): GPIO_PIN_SET
    <9d0>   DW_AT_const_value : 1
 <2><9d1>: Abbrev Number: 0
 <1><9d2>: Abbrev Number: 5 (DW_TAG_typedef)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xd14bf): GPIO_PinState
    <9d7>   DW_AT_decl_file   : 9
    <9d8>   DW_AT_decl_line   : 71
    <9d9>   DW_AT_decl_column : 2
    <9da>   DW_AT_type        : <0x9b7>
 <1><9de>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9df>   DW_AT_byte_size   : 48
    <9e0>   DW_AT_decl_file   : 10
    <9e1>   DW_AT_decl_line   : 48
    <9e2>   DW_AT_decl_column : 9
    <9e2>   DW_AT_sibling     : <0xa83>
 <2><9e6>: Abbrev Number: 1 (DW_TAG_member)
    <9e7>   DW_AT_name        : (indirect string, offset: 0xd0495): Channel
    <9eb>   DW_AT_decl_file   : 10
    <9ec>   DW_AT_decl_line   : 50
    <9ed>   DW_AT_decl_column : 12
    <9ee>   DW_AT_type        : <0x2fb>
    <9f2>   DW_AT_data_member_location: 0
 <2><9f3>: Abbrev Number: 1 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0xd0080): Direction
    <9f8>   DW_AT_decl_file   : 10
    <9f9>   DW_AT_decl_line   : 53
    <9fa>   DW_AT_decl_column : 12
    <9fb>   DW_AT_type        : <0x2fb>
    <9ff>   DW_AT_data_member_location: 4
 <2><a00>: Abbrev Number: 1 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0xcf670): PeriphInc
    <a05>   DW_AT_decl_file   : 10
    <a06>   DW_AT_decl_line   : 57
    <a07>   DW_AT_decl_column : 12
    <a08>   DW_AT_type        : <0x2fb>
    <a0c>   DW_AT_data_member_location: 8
 <2><a0d>: Abbrev Number: 1 (DW_TAG_member)
    <a0e>   DW_AT_name        : (indirect string, offset: 0xcf812): MemInc
    <a12>   DW_AT_decl_file   : 10
    <a13>   DW_AT_decl_line   : 60
    <a14>   DW_AT_decl_column : 12
    <a15>   DW_AT_type        : <0x2fb>
    <a19>   DW_AT_data_member_location: 12
 <2><a1a>: Abbrev Number: 1 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0xd03c6): PeriphDataAlignment
    <a1f>   DW_AT_decl_file   : 10
    <a20>   DW_AT_decl_line   : 63
    <a21>   DW_AT_decl_column : 12
    <a22>   DW_AT_type        : <0x2fb>
    <a26>   DW_AT_data_member_location: 16
 <2><a27>: Abbrev Number: 1 (DW_TAG_member)
    <a28>   DW_AT_name        : (indirect string, offset: 0xd1263): MemDataAlignment
    <a2c>   DW_AT_decl_file   : 10
    <a2d>   DW_AT_decl_line   : 66
    <a2e>   DW_AT_decl_column : 12
    <a2f>   DW_AT_type        : <0x2fb>
    <a33>   DW_AT_data_member_location: 20
 <2><a34>: Abbrev Number: 1 (DW_TAG_member)
    <a35>   DW_AT_name        : (indirect string, offset: 0xd01a3): Mode
    <a39>   DW_AT_decl_file   : 10
    <a3a>   DW_AT_decl_line   : 69
    <a3b>   DW_AT_decl_column : 12
    <a3c>   DW_AT_type        : <0x2fb>
    <a40>   DW_AT_data_member_location: 24
 <2><a41>: Abbrev Number: 1 (DW_TAG_member)
    <a42>   DW_AT_name        : (indirect string, offset: 0xd4594): Priority
    <a46>   DW_AT_decl_file   : 10
    <a47>   DW_AT_decl_line   : 74
    <a48>   DW_AT_decl_column : 12
    <a49>   DW_AT_type        : <0x2fb>
    <a4d>   DW_AT_data_member_location: 28
 <2><a4e>: Abbrev Number: 1 (DW_TAG_member)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xd018f): FIFOMode
    <a53>   DW_AT_decl_file   : 10
    <a54>   DW_AT_decl_line   : 77
    <a55>   DW_AT_decl_column : 12
    <a56>   DW_AT_type        : <0x2fb>
    <a5a>   DW_AT_data_member_location: 32
 <2><a5b>: Abbrev Number: 1 (DW_TAG_member)
    <a5c>   DW_AT_name        : (indirect string, offset: 0xd0dad): FIFOThreshold
    <a60>   DW_AT_decl_file   : 10
    <a61>   DW_AT_decl_line   : 82
    <a62>   DW_AT_decl_column : 12
    <a63>   DW_AT_type        : <0x2fb>
    <a67>   DW_AT_data_member_location: 36
 <2><a68>: Abbrev Number: 1 (DW_TAG_member)
    <a69>   DW_AT_name        : (indirect string, offset: 0xd0d6b): MemBurst
    <a6d>   DW_AT_decl_file   : 10
    <a6e>   DW_AT_decl_line   : 85
    <a6f>   DW_AT_decl_column : 12
    <a70>   DW_AT_type        : <0x2fb>
    <a74>   DW_AT_data_member_location: 40
 <2><a75>: Abbrev Number: 1 (DW_TAG_member)
    <a76>   DW_AT_name        : (indirect string, offset: 0xcffed): PeriphBurst
    <a7a>   DW_AT_decl_file   : 10
    <a7b>   DW_AT_decl_line   : 91
    <a7c>   DW_AT_decl_column : 12
    <a7d>   DW_AT_type        : <0x2fb>
    <a81>   DW_AT_data_member_location: 44
 <2><a82>: Abbrev Number: 0
 <1><a83>: Abbrev Number: 5 (DW_TAG_typedef)
    <a84>   DW_AT_name        : (indirect string, offset: 0xcfd08): DMA_InitTypeDef
    <a88>   DW_AT_decl_file   : 10
    <a89>   DW_AT_decl_line   : 96
    <a8a>   DW_AT_decl_column : 2
    <a8b>   DW_AT_type        : <0x9de>
 <1><a8f>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <a90>   DW_AT_encoding    : 7	(unsigned)
    <a91>   DW_AT_byte_size   : 1
    <a92>   DW_AT_type        : <0x282>
    <a96>   DW_AT_decl_file   : 10
    <a97>   DW_AT_decl_line   : 103
    <a98>   DW_AT_decl_column : 1
    <a99>   DW_AT_sibling     : <0xac2>
 <2><a9d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a9e>   DW_AT_name        : (indirect string, offset: 0xd0d57): HAL_DMA_STATE_RESET
    <aa2>   DW_AT_const_value : 0
 <2><aa3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aa4>   DW_AT_name        : (indirect string, offset: 0xcfd23): HAL_DMA_STATE_READY
    <aa8>   DW_AT_const_value : 1
 <2><aa9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aaa>   DW_AT_name        : (indirect string, offset: 0xd0bf4): HAL_DMA_STATE_BUSY
    <aae>   DW_AT_const_value : 2
 <2><aaf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ab0>   DW_AT_name        : (indirect string, offset: 0xd14f1): HAL_DMA_STATE_TIMEOUT
    <ab4>   DW_AT_const_value : 3
 <2><ab5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ab6>   DW_AT_name        : (indirect string, offset: 0xd10e2): HAL_DMA_STATE_ERROR
    <aba>   DW_AT_const_value : 4
 <2><abb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <abc>   DW_AT_name        : (indirect string, offset: 0xcfc40): HAL_DMA_STATE_ABORT
    <ac0>   DW_AT_const_value : 5
 <2><ac1>: Abbrev Number: 0
 <1><ac2>: Abbrev Number: 5 (DW_TAG_typedef)
    <ac3>   DW_AT_name        : (indirect string, offset: 0xd1246): HAL_DMA_StateTypeDef
    <ac7>   DW_AT_decl_file   : 10
    <ac8>   DW_AT_decl_line   : 110
    <ac9>   DW_AT_decl_column : 2
    <aca>   DW_AT_type        : <0xa8f>
 <1><ace>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <acf>   DW_AT_type        : <0xac2>
 <1><ad3>: Abbrev Number: 31 (DW_TAG_structure_type)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xd10a2): __DMA_HandleTypeDef
    <ad8>   DW_AT_byte_size   : 96
    <ad9>   DW_AT_decl_file   : 10
    <ada>   DW_AT_decl_line   : 138
    <adb>   DW_AT_decl_column : 16
    <adb>   DW_AT_sibling     : <0xb96>
 <2><adf>: Abbrev Number: 1 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0xd145a): Instance
    <ae4>   DW_AT_decl_file   : 10
    <ae5>   DW_AT_decl_line   : 140
    <ae6>   DW_AT_decl_column : 31
    <ae7>   DW_AT_type        : <0xb96>
    <aeb>   DW_AT_data_member_location: 0
 <2><aec>: Abbrev Number: 1 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0xd4c32): Init
    <af1>   DW_AT_decl_file   : 10
    <af2>   DW_AT_decl_line   : 142
    <af3>   DW_AT_decl_column : 30
    <af4>   DW_AT_type        : <0xa83>
    <af8>   DW_AT_data_member_location: 4
 <2><af9>: Abbrev Number: 1 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x928ac): Lock
    <afe>   DW_AT_decl_file   : 10
    <aff>   DW_AT_decl_line   : 144
    <b00>   DW_AT_decl_column : 30
    <b01>   DW_AT_type        : <0x81f>
    <b05>   DW_AT_data_member_location: 52
 <2><b06>: Abbrev Number: 1 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0xd0ba1): State
    <b0b>   DW_AT_decl_file   : 10
    <b0c>   DW_AT_decl_line   : 146
    <b0d>   DW_AT_decl_column : 30
    <b0e>   DW_AT_type        : <0xace>
    <b12>   DW_AT_data_member_location: 53
 <2><b13>: Abbrev Number: 1 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0xd1422): Parent
    <b18>   DW_AT_decl_file   : 10
    <b19>   DW_AT_decl_line   : 148
    <b1a>   DW_AT_decl_column : 31
    <b1b>   DW_AT_type        : <0xb9b>
    <b1f>   DW_AT_data_member_location: 56
 <2><b20>: Abbrev Number: 1 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0xd1507): XferCpltCallback
    <b25>   DW_AT_decl_file   : 10
    <b26>   DW_AT_decl_line   : 150
    <b27>   DW_AT_decl_column : 33
    <b28>   DW_AT_type        : <0xbad>
    <b2c>   DW_AT_data_member_location: 60
 <2><b2d>: Abbrev Number: 1 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xd0e00): XferHalfCpltCallback
    <b32>   DW_AT_decl_file   : 10
    <b33>   DW_AT_decl_line   : 152
    <b34>   DW_AT_decl_column : 33
    <b35>   DW_AT_type        : <0xbad>
    <b39>   DW_AT_data_member_location: 64
 <2><b3a>: Abbrev Number: 1 (DW_TAG_member)
    <b3b>   DW_AT_name        : (indirect string, offset: 0xd12cd): XferM1CpltCallback
    <b3f>   DW_AT_decl_file   : 10
    <b40>   DW_AT_decl_line   : 154
    <b41>   DW_AT_decl_column : 33
    <b42>   DW_AT_type        : <0xbad>
    <b46>   DW_AT_data_member_location: 68
 <2><b47>: Abbrev Number: 1 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0xd0298): XferM1HalfCpltCallback
    <b4c>   DW_AT_decl_file   : 10
    <b4d>   DW_AT_decl_line   : 156
    <b4e>   DW_AT_decl_column : 33
    <b4f>   DW_AT_type        : <0xbad>
    <b53>   DW_AT_data_member_location: 72
 <2><b54>: Abbrev Number: 1 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0xcf7e6): XferErrorCallback
    <b59>   DW_AT_decl_file   : 10
    <b5a>   DW_AT_decl_line   : 158
    <b5b>   DW_AT_decl_column : 33
    <b5c>   DW_AT_type        : <0xbad>
    <b60>   DW_AT_data_member_location: 76
 <2><b61>: Abbrev Number: 1 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0xd133a): XferAbortCallback
    <b66>   DW_AT_decl_file   : 10
    <b67>   DW_AT_decl_line   : 160
    <b68>   DW_AT_decl_column : 33
    <b69>   DW_AT_type        : <0xbad>
    <b6d>   DW_AT_data_member_location: 80
 <2><b6e>: Abbrev Number: 1 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0xd1491): ErrorCode
    <b73>   DW_AT_decl_file   : 10
    <b74>   DW_AT_decl_line   : 162
    <b75>   DW_AT_decl_column : 30
    <b76>   DW_AT_type        : <0x307>
    <b7a>   DW_AT_data_member_location: 84
 <2><b7b>: Abbrev Number: 1 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0xd01e5): StreamBaseAddress
    <b80>   DW_AT_decl_file   : 10
    <b81>   DW_AT_decl_line   : 164
    <b82>   DW_AT_decl_column : 30
    <b83>   DW_AT_type        : <0x2fb>
    <b87>   DW_AT_data_member_location: 88
 <2><b88>: Abbrev Number: 1 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0xd0fdf): StreamIndex
    <b8d>   DW_AT_decl_file   : 10
    <b8e>   DW_AT_decl_line   : 166
    <b8f>   DW_AT_decl_column : 30
    <b90>   DW_AT_type        : <0x2fb>
    <b94>   DW_AT_data_member_location: 92
 <2><b95>: Abbrev Number: 0
 <1><b96>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b97>   DW_AT_byte_size   : 4
    <b97>   DW_AT_type        : <0x373>
 <1><b9b>: Abbrev Number: 41 (DW_TAG_pointer_type)
    <b9c>   DW_AT_byte_size   : 4
 <1><b9d>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <b9e>   DW_AT_prototyped  : 1
    <b9e>   DW_AT_sibling     : <0xba8>
 <2><ba2>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ba3>   DW_AT_type        : <0xba8>
 <2><ba7>: Abbrev Number: 0
 <1><ba8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ba9>   DW_AT_byte_size   : 4
    <ba9>   DW_AT_type        : <0xad3>
 <1><bad>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <bae>   DW_AT_byte_size   : 4
    <bae>   DW_AT_type        : <0xb9d>
 <1><bb2>: Abbrev Number: 5 (DW_TAG_typedef)
    <bb3>   DW_AT_name        : (indirect string, offset: 0xd10a4): DMA_HandleTypeDef
    <bb7>   DW_AT_decl_file   : 10
    <bb8>   DW_AT_decl_line   : 168
    <bb9>   DW_AT_decl_column : 2
    <bba>   DW_AT_type        : <0xad3>
 <1><bbe>: Abbrev Number: 15 (DW_TAG_structure_type)
    <bbf>   DW_AT_byte_size   : 24
    <bc0>   DW_AT_decl_file   : 11
    <bc1>   DW_AT_decl_line   : 46
    <bc2>   DW_AT_decl_column : 9
    <bc2>   DW_AT_sibling     : <0xc15>
 <2><bc6>: Abbrev Number: 1 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0xd3b93): Prescaler
    <bcb>   DW_AT_decl_file   : 11
    <bcc>   DW_AT_decl_line   : 48
    <bcd>   DW_AT_decl_column : 12
    <bce>   DW_AT_type        : <0x2fb>
    <bd2>   DW_AT_data_member_location: 0
 <2><bd3>: Abbrev Number: 1 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0xd128f): CounterMode
    <bd8>   DW_AT_decl_file   : 11
    <bd9>   DW_AT_decl_line   : 51
    <bda>   DW_AT_decl_column : 12
    <bdb>   DW_AT_type        : <0x2fb>
    <bdf>   DW_AT_data_member_location: 4
 <2><be0>: Abbrev Number: 1 (DW_TAG_member)
    <be1>   DW_AT_name        : (indirect string, offset: 0xdbc51): Period
    <be5>   DW_AT_decl_file   : 11
    <be6>   DW_AT_decl_line   : 54
    <be7>   DW_AT_decl_column : 12
    <be8>   DW_AT_type        : <0x2fb>
    <bec>   DW_AT_data_member_location: 8
 <2><bed>: Abbrev Number: 1 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0xd00f0): ClockDivision
    <bf2>   DW_AT_decl_file   : 11
    <bf3>   DW_AT_decl_line   : 58
    <bf4>   DW_AT_decl_column : 12
    <bf5>   DW_AT_type        : <0x2fb>
    <bf9>   DW_AT_data_member_location: 12
 <2><bfa>: Abbrev Number: 1 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0xd0c45): RepetitionCounter
    <bff>   DW_AT_decl_file   : 11
    <c00>   DW_AT_decl_line   : 61
    <c01>   DW_AT_decl_column : 12
    <c02>   DW_AT_type        : <0x2fb>
    <c06>   DW_AT_data_member_location: 16
 <2><c07>: Abbrev Number: 1 (DW_TAG_member)
    <c08>   DW_AT_name        : (indirect string, offset: 0xd1314): AutoReloadPreload
    <c0c>   DW_AT_decl_file   : 11
    <c0d>   DW_AT_decl_line   : 72
    <c0e>   DW_AT_decl_column : 12
    <c0f>   DW_AT_type        : <0x2fb>
    <c13>   DW_AT_data_member_location: 20
 <2><c14>: Abbrev Number: 0
 <1><c15>: Abbrev Number: 5 (DW_TAG_typedef)
    <c16>   DW_AT_name        : (indirect string, offset: 0xd0035): TIM_Base_InitTypeDef
    <c1a>   DW_AT_decl_file   : 11
    <c1b>   DW_AT_decl_line   : 74
    <c1c>   DW_AT_decl_column : 3
    <c1d>   DW_AT_type        : <0xbbe>
 <1><c21>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c22>   DW_AT_byte_size   : 28
    <c23>   DW_AT_decl_file   : 11
    <c24>   DW_AT_decl_line   : 79
    <c25>   DW_AT_decl_column : 9
    <c25>   DW_AT_sibling     : <0xc85>
 <2><c29>: Abbrev Number: 1 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0xd01a1): OCMode
    <c2e>   DW_AT_decl_file   : 11
    <c2f>   DW_AT_decl_line   : 81
    <c30>   DW_AT_decl_column : 12
    <c31>   DW_AT_type        : <0x2fb>
    <c35>   DW_AT_data_member_location: 0
 <2><c36>: Abbrev Number: 1 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0xd0f7c): Pulse
    <c3b>   DW_AT_decl_file   : 11
    <c3c>   DW_AT_decl_line   : 84
    <c3d>   DW_AT_decl_column : 12
    <c3e>   DW_AT_type        : <0x2fb>
    <c42>   DW_AT_data_member_location: 4
 <2><c43>: Abbrev Number: 1 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0xd0a27): OCPolarity
    <c48>   DW_AT_decl_file   : 11
    <c49>   DW_AT_decl_line   : 87
    <c4a>   DW_AT_decl_column : 12
    <c4b>   DW_AT_type        : <0x2fb>
    <c4f>   DW_AT_data_member_location: 8
 <2><c50>: Abbrev Number: 1 (DW_TAG_member)
    <c51>   DW_AT_name        : (indirect string, offset: 0xcf8cb): OCNPolarity
    <c55>   DW_AT_decl_file   : 11
    <c56>   DW_AT_decl_line   : 90
    <c57>   DW_AT_decl_column : 12
    <c58>   DW_AT_type        : <0x2fb>
    <c5c>   DW_AT_data_member_location: 12
 <2><c5d>: Abbrev Number: 1 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0xcf7db): OCFastMode
    <c62>   DW_AT_decl_file   : 11
    <c63>   DW_AT_decl_line   : 94
    <c64>   DW_AT_decl_column : 12
    <c65>   DW_AT_type        : <0x2fb>
    <c69>   DW_AT_data_member_location: 16
 <2><c6a>: Abbrev Number: 1 (DW_TAG_member)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xd00c2): OCIdleState
    <c6f>   DW_AT_decl_file   : 11
    <c70>   DW_AT_decl_line   : 99
    <c71>   DW_AT_decl_column : 12
    <c72>   DW_AT_type        : <0x2fb>
    <c76>   DW_AT_data_member_location: 20
 <2><c77>: Abbrev Number: 1 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0xcf7a8): OCNIdleState
    <c7c>   DW_AT_decl_file   : 11
    <c7d>   DW_AT_decl_line   : 103
    <c7e>   DW_AT_decl_column : 12
    <c7f>   DW_AT_type        : <0x2fb>
    <c83>   DW_AT_data_member_location: 24
 <2><c84>: Abbrev Number: 0
 <1><c85>: Abbrev Number: 5 (DW_TAG_typedef)
    <c86>   DW_AT_name        : (indirect string, offset: 0xcf6df): TIM_OC_InitTypeDef
    <c8a>   DW_AT_decl_file   : 11
    <c8b>   DW_AT_decl_line   : 106
    <c8c>   DW_AT_decl_column : 3
    <c8d>   DW_AT_type        : <0xc21>
 <1><c91>: Abbrev Number: 17 (DW_TAG_const_type)
    <c92>   DW_AT_type        : <0xc85>
 <1><c96>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c97>   DW_AT_byte_size   : 16
    <c98>   DW_AT_decl_file   : 11
    <c99>   DW_AT_decl_line   : 198
    <c9a>   DW_AT_decl_column : 9
    <c9a>   DW_AT_sibling     : <0xcd3>
 <2><c9e>: Abbrev Number: 1 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0xcf806): ClockSource
    <ca3>   DW_AT_decl_file   : 11
    <ca4>   DW_AT_decl_line   : 200
    <ca5>   DW_AT_decl_column : 12
    <ca6>   DW_AT_type        : <0x2fb>
    <caa>   DW_AT_data_member_location: 0
 <2><cab>: Abbrev Number: 1 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0xd0592): ClockPolarity
    <cb0>   DW_AT_decl_file   : 11
    <cb1>   DW_AT_decl_line   : 202
    <cb2>   DW_AT_decl_column : 12
    <cb3>   DW_AT_type        : <0x2fb>
    <cb7>   DW_AT_data_member_location: 4
 <2><cb8>: Abbrev Number: 1 (DW_TAG_member)
    <cb9>   DW_AT_name        : (indirect string, offset: 0xd1192): ClockPrescaler
    <cbd>   DW_AT_decl_file   : 11
    <cbe>   DW_AT_decl_line   : 204
    <cbf>   DW_AT_decl_column : 12
    <cc0>   DW_AT_type        : <0x2fb>
    <cc4>   DW_AT_data_member_location: 8
 <2><cc5>: Abbrev Number: 1 (DW_TAG_member)
    <cc6>   DW_AT_name        : (indirect string, offset: 0xd09c1): ClockFilter
    <cca>   DW_AT_decl_file   : 11
    <ccb>   DW_AT_decl_line   : 206
    <ccc>   DW_AT_decl_column : 12
    <ccd>   DW_AT_type        : <0x2fb>
    <cd1>   DW_AT_data_member_location: 12
 <2><cd2>: Abbrev Number: 0
 <1><cd3>: Abbrev Number: 5 (DW_TAG_typedef)
    <cd4>   DW_AT_name        : (indirect string, offset: 0xcf5fb): TIM_ClockConfigTypeDef
    <cd8>   DW_AT_decl_file   : 11
    <cd9>   DW_AT_decl_line   : 208
    <cda>   DW_AT_decl_column : 3
    <cdb>   DW_AT_type        : <0xc96>
 <1><cdf>: Abbrev Number: 17 (DW_TAG_const_type)
    <ce0>   DW_AT_type        : <0xcd3>
 <1><ce4>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ce5>   DW_AT_byte_size   : 8
    <ce6>   DW_AT_decl_file   : 11
    <ce7>   DW_AT_decl_line   : 231
    <ce8>   DW_AT_decl_column : 9
    <ce8>   DW_AT_sibling     : <0xd07>
 <2><cec>: Abbrev Number: 1 (DW_TAG_member)
    <ced>   DW_AT_name        : (indirect string, offset: 0xd074a): MasterOutputTrigger
    <cf1>   DW_AT_decl_file   : 11
    <cf2>   DW_AT_decl_line   : 233
    <cf3>   DW_AT_decl_column : 13
    <cf4>   DW_AT_type        : <0x2fb>
    <cf8>   DW_AT_data_member_location: 0
 <2><cf9>: Abbrev Number: 1 (DW_TAG_member)
    <cfa>   DW_AT_name        : (indirect string, offset: 0xd04b3): MasterSlaveMode
    <cfe>   DW_AT_decl_file   : 11
    <cff>   DW_AT_decl_line   : 235
    <d00>   DW_AT_decl_column : 13
    <d01>   DW_AT_type        : <0x2fb>
    <d05>   DW_AT_data_member_location: 4
 <2><d06>: Abbrev Number: 0
 <1><d07>: Abbrev Number: 5 (DW_TAG_typedef)
    <d08>   DW_AT_name        : (indirect string, offset: 0xd0cc6): TIM_MasterConfigTypeDef
    <d0c>   DW_AT_decl_file   : 11
    <d0d>   DW_AT_decl_line   : 242
    <d0e>   DW_AT_decl_column : 3
    <d0f>   DW_AT_type        : <0xce4>
 <1><d13>: Abbrev Number: 17 (DW_TAG_const_type)
    <d14>   DW_AT_type        : <0xd07>
 <1><d18>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d19>   DW_AT_byte_size   : 32
    <d1a>   DW_AT_decl_file   : 11
    <d1b>   DW_AT_decl_line   : 267
    <d1d>   DW_AT_decl_column : 9
    <d1d>   DW_AT_sibling     : <0xd92>
 <2><d21>: Abbrev Number: 3 (DW_TAG_member)
    <d22>   DW_AT_name        : (indirect string, offset: 0xcf660): OffStateRunMode
    <d26>   DW_AT_decl_file   : 11
    <d27>   DW_AT_decl_line   : 269
    <d29>   DW_AT_decl_column : 12
    <d2a>   DW_AT_type        : <0x2fb>
    <d2e>   DW_AT_data_member_location: 0
 <2><d2f>: Abbrev Number: 3 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0xd0d74): OffStateIDLEMode
    <d34>   DW_AT_decl_file   : 11
    <d35>   DW_AT_decl_line   : 271
    <d37>   DW_AT_decl_column : 12
    <d38>   DW_AT_type        : <0x2fb>
    <d3c>   DW_AT_data_member_location: 4
 <2><d3d>: Abbrev Number: 3 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0xd03f6): LockLevel
    <d42>   DW_AT_decl_file   : 11
    <d43>   DW_AT_decl_line   : 273
    <d45>   DW_AT_decl_column : 12
    <d46>   DW_AT_type        : <0x2fb>
    <d4a>   DW_AT_data_member_location: 8
 <2><d4b>: Abbrev Number: 3 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xd025d): DeadTime
    <d50>   DW_AT_decl_file   : 11
    <d51>   DW_AT_decl_line   : 275
    <d53>   DW_AT_decl_column : 12
    <d54>   DW_AT_type        : <0x2fb>
    <d58>   DW_AT_data_member_location: 12
 <2><d59>: Abbrev Number: 3 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0xd05b1): BreakState
    <d5e>   DW_AT_decl_file   : 11
    <d5f>   DW_AT_decl_line   : 277
    <d61>   DW_AT_decl_column : 12
    <d62>   DW_AT_type        : <0x2fb>
    <d66>   DW_AT_data_member_location: 16
 <2><d67>: Abbrev Number: 3 (DW_TAG_member)
    <d68>   DW_AT_name        : (indirect string, offset: 0xd0f4c): BreakPolarity
    <d6c>   DW_AT_decl_file   : 11
    <d6d>   DW_AT_decl_line   : 279
    <d6f>   DW_AT_decl_column : 12
    <d70>   DW_AT_type        : <0x2fb>
    <d74>   DW_AT_data_member_location: 20
 <2><d75>: Abbrev Number: 3 (DW_TAG_member)
    <d76>   DW_AT_name        : (indirect string, offset: 0xcff59): BreakFilter
    <d7a>   DW_AT_decl_file   : 11
    <d7b>   DW_AT_decl_line   : 281
    <d7d>   DW_AT_decl_column : 12
    <d7e>   DW_AT_type        : <0x2fb>
    <d82>   DW_AT_data_member_location: 24
 <2><d83>: Abbrev Number: 3 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0xd11d7): AutomaticOutput
    <d88>   DW_AT_decl_file   : 11
    <d89>   DW_AT_decl_line   : 283
    <d8b>   DW_AT_decl_column : 12
    <d8c>   DW_AT_type        : <0x2fb>
    <d90>   DW_AT_data_member_location: 28
 <2><d91>: Abbrev Number: 0
 <1><d92>: Abbrev Number: 12 (DW_TAG_typedef)
    <d93>   DW_AT_name        : (indirect string, offset: 0xcfc54): TIM_BreakDeadTimeConfigTypeDef
    <d97>   DW_AT_decl_file   : 11
    <d98>   DW_AT_decl_line   : 285
    <d9a>   DW_AT_decl_column : 3
    <d9a>   DW_AT_type        : <0xd18>
 <1><d9e>: Abbrev Number: 17 (DW_TAG_const_type)
    <d9f>   DW_AT_type        : <0xd92>
 <1><da3>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <da4>   DW_AT_encoding    : 7	(unsigned)
    <da4>   DW_AT_byte_size   : 1
    <da4>   DW_AT_type        : <0x282>
    <da8>   DW_AT_decl_file   : 11
    <da8>   DW_AT_decl_line   : 291
    <daa>   DW_AT_decl_column : 1
    <daa>   DW_AT_sibling     : <0xdcd>
 <2><dae>: Abbrev Number: 2 (DW_TAG_enumerator)
    <daf>   DW_AT_name        : (indirect string, offset: 0xd115a): HAL_TIM_STATE_RESET
    <db3>   DW_AT_const_value : 0
 <2><db4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <db5>   DW_AT_name        : (indirect string, offset: 0xcf612): HAL_TIM_STATE_READY
    <db9>   DW_AT_const_value : 1
 <2><dba>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dbb>   DW_AT_name        : (indirect string, offset: 0xcfcac): HAL_TIM_STATE_BUSY
    <dbf>   DW_AT_const_value : 2
 <2><dc0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dc1>   DW_AT_name        : (indirect string, offset: 0xd0f82): HAL_TIM_STATE_TIMEOUT
    <dc5>   DW_AT_const_value : 3
 <2><dc6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dc7>   DW_AT_name        : (indirect string, offset: 0xd07f9): HAL_TIM_STATE_ERROR
    <dcb>   DW_AT_const_value : 4
 <2><dcc>: Abbrev Number: 0
 <1><dcd>: Abbrev Number: 12 (DW_TAG_typedef)
    <dce>   DW_AT_name        : (indirect string, offset: 0xd0a12): HAL_TIM_StateTypeDef
    <dd2>   DW_AT_decl_file   : 11
    <dd3>   DW_AT_decl_line   : 297
    <dd5>   DW_AT_decl_column : 3
    <dd5>   DW_AT_type        : <0xda3>
 <1><dd9>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <dda>   DW_AT_type        : <0xdcd>
 <1><dde>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <ddf>   DW_AT_encoding    : 7	(unsigned)
    <ddf>   DW_AT_byte_size   : 1
    <ddf>   DW_AT_type        : <0x282>
    <de3>   DW_AT_decl_file   : 11
    <de3>   DW_AT_decl_line   : 303
    <de5>   DW_AT_decl_column : 1
    <de5>   DW_AT_sibling     : <0xdfc>
 <2><de9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dea>   DW_AT_name        : (indirect string, offset: 0xd0c72): HAL_TIM_CHANNEL_STATE_RESET
    <dee>   DW_AT_const_value : 0
 <2><def>: Abbrev Number: 2 (DW_TAG_enumerator)
    <df0>   DW_AT_name        : (indirect string, offset: 0xd072e): HAL_TIM_CHANNEL_STATE_READY
    <df4>   DW_AT_const_value : 1
 <2><df5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <df6>   DW_AT_name        : (indirect string, offset: 0xd02af): HAL_TIM_CHANNEL_STATE_BUSY
    <dfa>   DW_AT_const_value : 2
 <2><dfb>: Abbrev Number: 0
 <1><dfc>: Abbrev Number: 12 (DW_TAG_typedef)
    <dfd>   DW_AT_name        : (indirect string, offset: 0xcfb8a): HAL_TIM_ChannelStateTypeDef
    <e01>   DW_AT_decl_file   : 11
    <e02>   DW_AT_decl_line   : 307
    <e04>   DW_AT_decl_column : 3
    <e04>   DW_AT_type        : <0xdde>
 <1><e08>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <e09>   DW_AT_type        : <0xdfc>
 <1><e0d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <e0e>   DW_AT_encoding    : 7	(unsigned)
    <e0e>   DW_AT_byte_size   : 1
    <e0e>   DW_AT_type        : <0x282>
    <e12>   DW_AT_decl_file   : 11
    <e12>   DW_AT_decl_line   : 313
    <e14>   DW_AT_decl_column : 1
    <e14>   DW_AT_sibling     : <0xe2b>
 <2><e18>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e19>   DW_AT_name        : (indirect string, offset: 0xcf5a5): HAL_DMA_BURST_STATE_RESET
    <e1d>   DW_AT_const_value : 0
 <2><e1e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e1f>   DW_AT_name        : (indirect string, offset: 0xd056a): HAL_DMA_BURST_STATE_READY
    <e23>   DW_AT_const_value : 1
 <2><e24>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e25>   DW_AT_name        : (indirect string, offset: 0xcff95): HAL_DMA_BURST_STATE_BUSY
    <e29>   DW_AT_const_value : 2
 <2><e2a>: Abbrev Number: 0
 <1><e2b>: Abbrev Number: 12 (DW_TAG_typedef)
    <e2c>   DW_AT_name        : (indirect string, offset: 0xd12e9): HAL_TIM_DMABurstStateTypeDef
    <e30>   DW_AT_decl_file   : 11
    <e31>   DW_AT_decl_line   : 317
    <e33>   DW_AT_decl_column : 3
    <e33>   DW_AT_type        : <0xe0d>
 <1><e37>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <e38>   DW_AT_type        : <0xe2b>
 <1><e3c>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <e3d>   DW_AT_encoding    : 7	(unsigned)
    <e3d>   DW_AT_byte_size   : 1
    <e3d>   DW_AT_type        : <0x282>
    <e41>   DW_AT_decl_file   : 11
    <e41>   DW_AT_decl_line   : 323
    <e43>   DW_AT_decl_column : 1
    <e43>   DW_AT_sibling     : <0xe66>
 <2><e47>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e48>   DW_AT_name        : (indirect string, offset: 0xd05e0): HAL_TIM_ACTIVE_CHANNEL_1
    <e4c>   DW_AT_const_value : 1
 <2><e4d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e4e>   DW_AT_name        : (indirect string, offset: 0xd05f9): HAL_TIM_ACTIVE_CHANNEL_2
    <e52>   DW_AT_const_value : 2
 <2><e53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e54>   DW_AT_name        : (indirect string, offset: 0xd0612): HAL_TIM_ACTIVE_CHANNEL_3
    <e58>   DW_AT_const_value : 4
 <2><e59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e5a>   DW_AT_name        : (indirect string, offset: 0xd062b): HAL_TIM_ACTIVE_CHANNEL_4
    <e5e>   DW_AT_const_value : 8
 <2><e5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e60>   DW_AT_name        : (indirect string, offset: 0xd0122): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <e64>   DW_AT_const_value : 0
 <2><e65>: Abbrev Number: 0
 <1><e66>: Abbrev Number: 12 (DW_TAG_typedef)
    <e67>   DW_AT_name        : (indirect string, offset: 0xd0487): HAL_TIM_ActiveChannel
    <e6b>   DW_AT_decl_file   : 11
    <e6c>   DW_AT_decl_line   : 329
    <e6e>   DW_AT_decl_column : 3
    <e6e>   DW_AT_type        : <0xe3c>
 <1><e72>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e73>   DW_AT_byte_size   : 72
    <e74>   DW_AT_decl_file   : 11
    <e75>   DW_AT_decl_line   : 337
    <e77>   DW_AT_decl_column : 9
    <e77>   DW_AT_sibling     : <0xefa>
 <2><e7b>: Abbrev Number: 3 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xd145a): Instance
    <e80>   DW_AT_decl_file   : 11
    <e81>   DW_AT_decl_line   : 340
    <e83>   DW_AT_decl_column : 39
    <e84>   DW_AT_type        : <0xefa>
    <e88>   DW_AT_data_member_location: 0
 <2><e89>: Abbrev Number: 3 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0xd4c32): Init
    <e8e>   DW_AT_decl_file   : 11
    <e8f>   DW_AT_decl_line   : 341
    <e91>   DW_AT_decl_column : 38
    <e92>   DW_AT_type        : <0xc15>
    <e96>   DW_AT_data_member_location: 4
 <2><e97>: Abbrev Number: 3 (DW_TAG_member)
    <e98>   DW_AT_name        : (indirect string, offset: 0xd0495): Channel
    <e9c>   DW_AT_decl_file   : 11
    <e9d>   DW_AT_decl_line   : 342
    <e9f>   DW_AT_decl_column : 38
    <ea0>   DW_AT_type        : <0xe66>
    <ea4>   DW_AT_data_member_location: 28
 <2><ea5>: Abbrev Number: 3 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0xd0778): hdma
    <eaa>   DW_AT_decl_file   : 11
    <eab>   DW_AT_decl_line   : 343
    <ead>   DW_AT_decl_column : 39
    <eae>   DW_AT_type        : <0xeff>
    <eb2>   DW_AT_data_member_location: 32
 <2><eb3>: Abbrev Number: 3 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x928ac): Lock
    <eb8>   DW_AT_decl_file   : 11
    <eb9>   DW_AT_decl_line   : 345
    <ebb>   DW_AT_decl_column : 38
    <ebc>   DW_AT_type        : <0x81f>
    <ec0>   DW_AT_data_member_location: 60
 <2><ec1>: Abbrev Number: 3 (DW_TAG_member)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xd0ba1): State
    <ec6>   DW_AT_decl_file   : 11
    <ec7>   DW_AT_decl_line   : 346
    <ec9>   DW_AT_decl_column : 38
    <eca>   DW_AT_type        : <0xdd9>
    <ece>   DW_AT_data_member_location: 61
 <2><ecf>: Abbrev Number: 3 (DW_TAG_member)
    <ed0>   DW_AT_name        : (indirect string, offset: 0xd58aa): ChannelState
    <ed4>   DW_AT_decl_file   : 11
    <ed5>   DW_AT_decl_line   : 347
    <ed7>   DW_AT_decl_column : 38
    <ed8>   DW_AT_type        : <0xf24>
    <edc>   DW_AT_data_member_location: 62
 <2><edd>: Abbrev Number: 3 (DW_TAG_member)
    <ede>   DW_AT_name        : (indirect string, offset: 0xd5df1): ChannelNState
    <ee2>   DW_AT_decl_file   : 11
    <ee3>   DW_AT_decl_line   : 348
    <ee5>   DW_AT_decl_column : 38
    <ee6>   DW_AT_type        : <0xf24>
    <eea>   DW_AT_data_member_location: 66
 <2><eeb>: Abbrev Number: 3 (DW_TAG_member)
    <eec>   DW_AT_name        : (indirect string, offset: 0xd5465): DMABurstState
    <ef0>   DW_AT_decl_file   : 11
    <ef1>   DW_AT_decl_line   : 349
    <ef3>   DW_AT_decl_column : 38
    <ef4>   DW_AT_type        : <0xe37>
    <ef8>   DW_AT_data_member_location: 70
 <2><ef9>: Abbrev Number: 0
 <1><efa>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <efb>   DW_AT_byte_size   : 4
    <efb>   DW_AT_type        : <0x754>
 <1><eff>: Abbrev Number: 23 (DW_TAG_array_type)
    <f00>   DW_AT_type        : <0xf0f>
    <f04>   DW_AT_sibling     : <0xf0f>
 <2><f08>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <f09>   DW_AT_type        : <0x2d2>
    <f0d>   DW_AT_upper_bound : 6
 <2><f0e>: Abbrev Number: 0
 <1><f0f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <f10>   DW_AT_byte_size   : 4
    <f10>   DW_AT_type        : <0xbb2>
 <1><f14>: Abbrev Number: 23 (DW_TAG_array_type)
    <f15>   DW_AT_type        : <0xe08>
    <f19>   DW_AT_sibling     : <0xf24>
 <2><f1d>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <f1e>   DW_AT_type        : <0x2d2>
    <f22>   DW_AT_upper_bound : 3
 <2><f23>: Abbrev Number: 0
 <1><f24>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <f25>   DW_AT_type        : <0xf14>
 <1><f29>: Abbrev Number: 12 (DW_TAG_typedef)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xd0023): TIM_HandleTypeDef
    <f2e>   DW_AT_decl_file   : 11
    <f2f>   DW_AT_decl_line   : 380
    <f31>   DW_AT_decl_column : 3
    <f31>   DW_AT_type        : <0xe72>
 <1><f35>: Abbrev Number: 15 (DW_TAG_structure_type)
    <f36>   DW_AT_byte_size   : 28
    <f37>   DW_AT_decl_file   : 12
    <f38>   DW_AT_decl_line   : 46
    <f39>   DW_AT_decl_column : 9
    <f39>   DW_AT_sibling     : <0xf99>
 <2><f3d>: Abbrev Number: 1 (DW_TAG_member)
    <f3e>   DW_AT_name        : (indirect string, offset: 0xd12c4): BaudRate
    <f42>   DW_AT_decl_file   : 12
    <f43>   DW_AT_decl_line   : 48
    <f44>   DW_AT_decl_column : 12
    <f45>   DW_AT_type        : <0x2fb>
    <f49>   DW_AT_data_member_location: 0
 <2><f4a>: Abbrev Number: 1 (DW_TAG_member)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xcf5f0): WordLength
    <f4f>   DW_AT_decl_file   : 12
    <f50>   DW_AT_decl_line   : 54
    <f51>   DW_AT_decl_column : 12
    <f52>   DW_AT_type        : <0x2fb>
    <f56>   DW_AT_data_member_location: 4
 <2><f57>: Abbrev Number: 1 (DW_TAG_member)
    <f58>   DW_AT_name        : (indirect string, offset: 0xd12e0): StopBits
    <f5c>   DW_AT_decl_file   : 12
    <f5d>   DW_AT_decl_line   : 57
    <f5e>   DW_AT_decl_column : 12
    <f5f>   DW_AT_type        : <0x2fb>
    <f63>   DW_AT_data_member_location: 8
 <2><f64>: Abbrev Number: 1 (DW_TAG_member)
    <f65>   DW_AT_name        : (indirect string, offset: 0xcfd65): Parity
    <f69>   DW_AT_decl_file   : 12
    <f6a>   DW_AT_decl_line   : 60
    <f6b>   DW_AT_decl_column : 12
    <f6c>   DW_AT_type        : <0x2fb>
    <f70>   DW_AT_data_member_location: 12
 <2><f71>: Abbrev Number: 1 (DW_TAG_member)
    <f72>   DW_AT_name        : (indirect string, offset: 0xd01a3): Mode
    <f76>   DW_AT_decl_file   : 12
    <f77>   DW_AT_decl_line   : 67
    <f78>   DW_AT_decl_column : 12
    <f79>   DW_AT_type        : <0x2fb>
    <f7d>   DW_AT_data_member_location: 16
 <2><f7e>: Abbrev Number: 1 (DW_TAG_member)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xcf74c): HwFlowCtl
    <f83>   DW_AT_decl_file   : 12
    <f84>   DW_AT_decl_line   : 70
    <f85>   DW_AT_decl_column : 12
    <f86>   DW_AT_type        : <0x2fb>
    <f8a>   DW_AT_data_member_location: 20
 <2><f8b>: Abbrev Number: 1 (DW_TAG_member)
    <f8c>   DW_AT_name        : (indirect string, offset: 0xd0fc8): OverSampling
    <f90>   DW_AT_decl_file   : 12
    <f91>   DW_AT_decl_line   : 73
    <f92>   DW_AT_decl_column : 12
    <f93>   DW_AT_type        : <0x2fb>
    <f97>   DW_AT_data_member_location: 24
 <2><f98>: Abbrev Number: 0
 <1><f99>: Abbrev Number: 5 (DW_TAG_typedef)
    <f9a>   DW_AT_name        : (indirect string, offset: 0xcfd54): UART_InitTypeDef
    <f9e>   DW_AT_decl_file   : 12
    <f9f>   DW_AT_decl_line   : 75
    <fa0>   DW_AT_decl_column : 3
    <fa1>   DW_AT_type        : <0xf35>
 <1><fa5>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <fa6>   DW_AT_encoding    : 7	(unsigned)
    <fa7>   DW_AT_byte_size   : 1
    <fa8>   DW_AT_type        : <0x282>
    <fac>   DW_AT_decl_file   : 12
    <fad>   DW_AT_decl_line   : 117
    <fae>   DW_AT_decl_column : 1
    <faf>   DW_AT_sibling     : <0xfe4>
 <2><fb3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xd0719): HAL_UART_STATE_RESET
    <fb8>   DW_AT_const_value : 0
 <2><fb9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fba>   DW_AT_name        : (indirect string, offset: 0xcf72a): HAL_UART_STATE_READY
    <fbe>   DW_AT_const_value : 32
 <2><fbf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xd11b6): HAL_UART_STATE_BUSY
    <fc4>   DW_AT_const_value : 36
 <2><fc5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xcf576): HAL_UART_STATE_BUSY_TX
    <fca>   DW_AT_const_value : 33
 <2><fcb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc>   DW_AT_name        : (indirect string, offset: 0xcf548): HAL_UART_STATE_BUSY_RX
    <fd0>   DW_AT_const_value : 34
 <2><fd1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xcfbfe): HAL_UART_STATE_BUSY_TX_RX
    <fd6>   DW_AT_const_value : 35
 <2><fd7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fd8>   DW_AT_name        : (indirect string, offset: 0xd02d6): HAL_UART_STATE_TIMEOUT
    <fdc>   DW_AT_const_value : 160
 <2><fdd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fde>   DW_AT_name        : (indirect string, offset: 0xd0c30): HAL_UART_STATE_ERROR
    <fe2>   DW_AT_const_value : 224
 <2><fe3>: Abbrev Number: 0
 <1><fe4>: Abbrev Number: 5 (DW_TAG_typedef)
    <fe5>   DW_AT_name        : (indirect string, offset: 0xcfed8): HAL_UART_StateTypeDef
    <fe9>   DW_AT_decl_file   : 12
    <fea>   DW_AT_decl_line   : 135
    <feb>   DW_AT_decl_column : 3
    <fec>   DW_AT_type        : <0xfa5>
 <1><ff0>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <ff1>   DW_AT_type        : <0xfe4>
 <1><ff5>: Abbrev Number: 5 (DW_TAG_typedef)
    <ff6>   DW_AT_name        : (indirect string, offset: 0xd010b): HAL_UART_RxTypeTypeDef
    <ffa>   DW_AT_decl_file   : 12
    <ffb>   DW_AT_decl_line   : 144
    <ffc>   DW_AT_decl_column : 18
    <ffd>   DW_AT_type        : <0x2fb>
 <1><1001>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <1002>   DW_AT_type        : <0xff5>
 <1><1006>: Abbrev Number: 5 (DW_TAG_typedef)
    <1007>   DW_AT_name        : (indirect string, offset: 0xcf78c): HAL_UART_RxEventTypeTypeDef
    <100b>   DW_AT_decl_file   : 12
    <100c>   DW_AT_decl_line   : 155
    <100d>   DW_AT_decl_column : 18
    <100e>   DW_AT_type        : <0x2fb>
 <1><1012>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <1013>   DW_AT_type        : <0x1006>
 <1><1017>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1018>   DW_AT_name        : (indirect string, offset: 0xd06e7): __UART_HandleTypeDef
    <101c>   DW_AT_byte_size   : 72
    <101d>   DW_AT_decl_file   : 12
    <101e>   DW_AT_decl_line   : 160
    <101f>   DW_AT_decl_column : 16
    <101f>   DW_AT_sibling     : <0x10f4>
 <2><1023>: Abbrev Number: 1 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0xd145a): Instance
    <1028>   DW_AT_decl_file   : 12
    <1029>   DW_AT_decl_line   : 162
    <102a>   DW_AT_decl_column : 34
    <102b>   DW_AT_type        : <0x10f4>
    <102f>   DW_AT_data_member_location: 0
 <2><1030>: Abbrev Number: 1 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0xd4c32): Init
    <1035>   DW_AT_decl_file   : 12
    <1036>   DW_AT_decl_line   : 164
    <1037>   DW_AT_decl_column : 33
    <1038>   DW_AT_type        : <0xf99>
    <103c>   DW_AT_data_member_location: 4
 <2><103d>: Abbrev Number: 1 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0xd028d): pTxBuffPtr
    <1042>   DW_AT_decl_file   : 12
    <1043>   DW_AT_decl_line   : 166
    <1044>   DW_AT_decl_column : 34
    <1045>   DW_AT_type        : <0x10f9>
    <1049>   DW_AT_data_member_location: 32
 <2><104a>: Abbrev Number: 1 (DW_TAG_member)
    <104b>   DW_AT_name        : (indirect string, offset: 0xd016f): TxXferSize
    <104f>   DW_AT_decl_file   : 12
    <1050>   DW_AT_decl_line   : 168
    <1051>   DW_AT_decl_column : 33
    <1052>   DW_AT_type        : <0x2ea>
    <1056>   DW_AT_data_member_location: 36
 <2><1057>: Abbrev Number: 1 (DW_TAG_member)
    <1058>   DW_AT_name        : (indirect string, offset: 0xd02ca): TxXferCount
    <105c>   DW_AT_decl_file   : 12
    <105d>   DW_AT_decl_line   : 170
    <105e>   DW_AT_decl_column : 33
    <105f>   DW_AT_type        : <0x2f6>
    <1063>   DW_AT_data_member_location: 38
 <2><1064>: Abbrev Number: 1 (DW_TAG_member)
